#language: ru

@tree
@ВидеоИнструкция
Функционал: ПРОИЗ Проверка кодов маркировки ГИС МТ



Сценарий: Проверка кодов маркировки ГИС МТ
#[autodoc.ignorestep]
	И я активизирую TestClient "Этот клиент"
* Привет Одинэс ! Подскажи пожалуйста, Как пользоваться обработкой Проверка кодов маркировки ГИС ЭМТ+Э
	@YandexTTS: voice=filipp; speed=1.2
	И Пауза 1
* Привет! Давай покажу.Сначало нужно зайти в эту обработку
	И Пауза 1
* Для этого заходим в базу Производства и нажимаем на вкладку слева ПРОИЗВОДСТВО
	Когда В панели разделов я выбираю 'Производство'	
* Далее нажимаем на эту обработку в разделе Сервис
		
	И пауза 1
