
#language: ru

@tree
@Smoketest
Функциональность: Дымовые тесты по справочникам

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	

	
Сценарий: Открытие формы списка "АвтоматическиеСкидки" 

	Дано Я открываю основную форму списка справочника "АвтоматическиеСкидки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвтоматическиеСкидки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвтоматическиеСкидки"

	Дано Я открываю основную форму справочника "АвтоматическиеСкидки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АвтоматическиеСкидки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АналитикаНачисленияБонусов" 

	Дано Я открываю основную форму списка справочника "АналитикаНачисленияБонусов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АналитикаНачисленияБонусов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АналитикаНачисленияБонусов"

	Дано Я открываю основную форму справочника "АналитикаНачисленияБонусов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника АналитикаНачисленияБонусов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Банки" 

	Дано Я открываю основную форму списка справочника "Банки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Банки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Банки"

	Дано Я открываю основную форму справочника "Банки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Банки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БанковскиеСчета" 

	Дано Я открываю основную форму списка справочника "БанковскиеСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БанковскиеСчета"

	Дано Я открываю основную форму справочника "БанковскиеСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БанковскиеСчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БланкиДоговоров" 

	Дано Я открываю основную форму списка справочника "БланкиДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БланкиДоговоров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БланкиДоговоров"

	Дано Я открываю основную форму справочника "БланкиДоговоров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БланкиДоговоров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "БонусныеПрограммы" 

	Дано Я открываю основную форму списка справочника "БонусныеПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БонусныеПрограммы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "БонусныеПрограммы"

	Дано Я открываю основную форму справочника "БонусныеПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника БонусныеПрограммы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бригады" 

	Дано Я открываю основную форму списка справочника "Бригады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Бригады"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бригады"

	Дано Я открываю основную форму справочника "Бригады"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Бригады"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыДополнительныхОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыДополнительныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыДополнительныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВариантыДополнительныхОтчетов"

	Дано Я открываю основную форму справочника "ВариантыДополнительныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыДополнительныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно



	
Сценарий: Открытие формы списка "ВетеринарноСопроводительныйДокументВЕТИС" 

	Дано Я открываю основную форму списка справочника "ВетеринарноСопроводительныйДокументВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВетеринарноСопроводительныйДокументВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВетеринарноСопроводительныйДокументВЕТИС"

	Дано Я открываю основную форму справочника "ВетеринарноСопроводительныйДокументВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВетеринарноСопроводительныйДокументВЕТИС"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ВидыАлкогольнойПродукции" 

	Дано Я открываю основную форму списка справочника "ВидыАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАлкогольнойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыАлкогольнойПродукции"

	Дано Я открываю основную форму справочника "ВидыАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыАлкогольнойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДеятельностиЕНВД" 

	Дано Я открываю основную форму списка справочника "ВидыДеятельностиЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДеятельностиЕНВД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДеятельностиЕНВД"

	Дано Я открываю основную форму справочника "ВидыДеятельностиЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДеятельностиЕНВД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДисконтныхКарт" 

	Дано Я открываю основную форму списка справочника "ВидыДисконтныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДисконтныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДисконтныхКарт"

	Дано Я открываю основную форму справочника "ВидыДисконтныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДисконтныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДокументовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДокументовФизическихЛиц"

	Дано Я открываю основную форму справочника "ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыДоходовПоСтраховымВзносам" 

	Дано Я открываю основную форму списка справочника "ВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыДоходовПоСтраховымВзносам"

	Дано Я открываю основную форму справочника "ВидыДоходовПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыДоходовПоСтраховымВзносам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗаказНарядов" 

	Дано Я открываю основную форму списка справочника "ВидыЗаказНарядов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗаказНарядов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗаказНарядов"

	Дано Я открываю основную форму справочника "ВидыЗаказНарядов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗаказНарядов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЗаказовПокупателей" 

	Дано Я открываю основную форму списка справочника "ВидыЗаказовПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗаказовПокупателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЗаказовПокупателей"

	Дано Я открываю основную форму справочника "ВидыЗаказовПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЗаказовПокупателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыМехаГИСМ" 

	Дано Я открываю основную форму списка справочника "ВидыМехаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМехаГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыМехаГИСМ"

	Дано Я открываю основную форму справочника "ВидыМехаГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыМехаГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНалогов" 

	Дано Я открываю основную форму списка справочника "ВидыНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалогов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНалогов"

	Дано Я открываю основную форму справочника "ВидыНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалогов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыНачисленийИУдержаний" 

	Дано Я открываю основную форму списка справочника "ВидыНачисленийИУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНачисленийИУдержаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыНачисленийИУдержаний"

	Дано Я открываю основную форму справочника "ВидыНачисленийИУдержаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыНачисленийИУдержаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыОтправляемыхДокументов" 

	Дано Я открываю основную форму списка справочника "ВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыОтправляемыхДокументов"

	Дано Я открываю основную форму справочника "ВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПлатежныхКарт" 

	Дано Я открываю основную форму списка справочника "ВидыПлатежныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПлатежныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПлатежныхКарт"

	Дано Я открываю основную форму справочника "ВидыПлатежныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПлатежныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПредпринимательскойДеятельности" 

	Дано Я открываю основную форму списка справочника "ВидыПредпринимательскойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПредпринимательскойДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПредпринимательскойДеятельности"

	Дано Я открываю основную форму справочника "ВидыПредпринимательскойДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПредпринимательскойДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПроизводства" 

	Дано Я открываю основную форму списка справочника "ВидыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыПроизводства"

	Дано Я открываю основную форму справочника "ВидыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРабочегоВремени" 

	Дано Я открываю основную форму списка справочника "ВидыРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРабочегоВремени"

	Дано Я открываю основную форму справочника "ВидыРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыРесурсовПредприятия" 

	Дано Я открываю основную форму списка справочника "ВидыРесурсовПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРесурсовПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыРесурсовПредприятия"

	Дано Я открываю основную форму справочника "ВидыРесурсовПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыРесурсовПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыСкидокНаценок" 

	Дано Я открываю основную форму списка справочника "ВидыСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСкидокНаценок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыСкидокНаценок"

	Дано Я открываю основную форму справочника "ВидыСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыСкидокНаценок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыТарифовСтраховыхВзносов" 

	Дано Я открываю основную форму списка справочника "ВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыТарифовСтраховыхВзносов"

	Дано Я открываю основную форму справочника "ВидыТарифовСтраховыхВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыТарифовСтраховыхВзносов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦен" 

	Дано Я открываю основную форму списка справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦен"

	Дано Я открываю основную форму справочника "ВидыЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦен"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыЦенКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ВидыЦенКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦенКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВидыЦенКонтрагентов"

	Дано Я открываю основную форму справочника "ВидыЦенКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыЦенКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнеоборотныеАктивы" 

	Дано Я открываю основную форму списка справочника "ВнеоборотныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнеоборотныеАктивы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнеоборотныеАктивы"

	Дано Я открываю основную форму справочника "ВнеоборотныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнеоборотныеАктивы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВычетыНДФЛ" 

	Дано Я открываю основную форму списка справочника "ВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВычетыНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВычетыНДФЛ"

	Дано Я открываю основную форму справочника "ВычетыНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВычетыНДФЛ"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ГрафикиРаботы" 

	Дано Я открываю основную форму списка справочника "ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГрафикиРаботы"

	Дано Я открываю основную форму справочника "ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГрафикиРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаКонтрагентов"

	Дано Я открываю основную форму справочника "ГруппыДоступаКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступаЛидов" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступаЛидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаЛидов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыДоступаЛидов"

	Дано Я открываю основную форму справочника "ГруппыДоступаЛидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступаЛидов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОбменаШтрихМПЭЙ" 

	Дано Я открываю основную форму списка справочника "ДанныеОбменаШтрихМПЭЙ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеОбменаШтрихМПЭЙ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОбменаШтрихМПЭЙ"

	Дано Я открываю основную форму справочника "ДанныеОбменаШтрихМПЭЙ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДанныеОбменаШтрихМПЭЙ"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ДействияРабочегоПроцесса" 

	Дано Я открываю основную форму списка справочника "ДействияРабочегоПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДействияРабочегоПроцесса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДействияРабочегоПроцесса"

	Дано Я открываю основную форму справочника "ДействияРабочегоПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДействияРабочегоПроцесса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Делегирование" 

	Дано Я открываю основную форму списка справочника "Делегирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Делегирование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Делегирование"

	Дано Я открываю основную форму справочника "Делегирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Делегирование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДисконтныеКарты" 

	Дано Я открываю основную форму списка справочника "ДисконтныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДисконтныеКарты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДисконтныеКарты"

	Дано Я открываю основную форму справочника "ДисконтныеКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДисконтныеКарты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоверенностиНалогоплательщика" 

	Дано Я открываю основную форму списка справочника "ДоверенностиНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоверенностиНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоверенностиНалогоплательщика"

	Дано Я открываю основную форму справочника "ДоверенностиНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоверенностиНалогоплательщика"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ДоговорыКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорыКонтрагентов"

	Дано Я открываю основную форму справочника "ДоговорыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДоговорыКонтрагентов"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ДокументыРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДокументыРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Должности" 

	Дано Я открываю основную форму списка справочника "Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Должности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Должности"

	Дано Я открываю основную форму справочника "Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Должности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ДополнительныеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ДополнительныеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОбработчикиОчередиЗаданий" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОбработчикиОчередиЗаданий"

	Дано Я открываю основную форму справочника "ДополнительныеОбработчикиОчередиЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОбработчикиОчередиЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
	
Сценарий: Открытие формы списка "ДополнительныеУсловия" 

	Дано Я открываю основную форму списка справочника "ДополнительныеУсловия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеУсловия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеУсловия"

	Дано Я открываю основную форму справочника "ДополнительныеУсловия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеУсловия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДрайверыОборудования" 

	Дано Я открываю основную форму списка справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДрайверыОборудования"

	Дано Я открываю основную форму справочника "ДрайверыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДрайверыОборудования"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ЕдиницыИзмерения" 

	Дано Я открываю основную форму списка справочника "ЕдиницыИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиницыИзмерения"

	Дано Я открываю основную форму справочника "ЕдиницыИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмерения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЕдиницыИзмеренияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЕдиницыИзмеренияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмеренияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЕдиницыИзмеренияВЕТИС"

	Дано Я открываю основную форму справочника "ЕдиницыИзмеренияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЕдиницыИзмеренияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаболеванияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЗаболеванияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаболеванияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаболеванияВЕТИС"

	Дано Я открываю основную форму справочника "ЗаболеванияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаболеванияВЕТИС"
	И Я закрываю текущее окно

	
	
Сценарий: Открытие формы списка "ЗадачиАссистентаПоНапоминаниямОЗаписи" 

	Дано Я открываю основную форму списка справочника "ЗадачиАссистентаПоНапоминаниямОЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиАссистентаПоНапоминаниямОЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадачиАссистентаПоНапоминаниямОЗаписи"

	Дано Я открываю основную форму справочника "ЗадачиАссистентаПоНапоминаниямОЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиАссистентаПоНапоминаниямОЗаписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗадачиАссистентаПоРасчетуНалогов" 

	Дано Я открываю основную форму списка справочника "ЗадачиАссистентаПоРасчетуНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиАссистентаПоРасчетуНалогов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадачиАссистентаПоРасчетуНалогов"

	Дано Я открываю основную форму справочника "ЗадачиАссистентаПоРасчетуНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиАссистентаПоРасчетуНалогов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗадачиАссистентаУправления" 

	Дано Я открываю основную форму списка справочника "ЗадачиАссистентаУправления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиАссистентаУправления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадачиАссистентаУправления"

	Дано Я открываю основную форму справочника "ЗадачиАссистентаУправления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиАссистентаУправления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗадачиКалендаряПодготовкиОтчетности" 

	Дано Я открываю основную форму списка справочника "ЗадачиКалендаряПодготовкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиКалендаряПодготовкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗадачиКалендаряПодготовкиОтчетности"

	Дано Я открываю основную форму справочника "ЗадачиКалендаряПодготовкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗадачиКалендаряПодготовкиОтчетности"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "ЗамещениеГосударственныхМуниципальныхДолжностейПФР" 

	Дано Я открываю основную форму списка справочника "ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗамещениеГосударственныхМуниципальныхДолжностейПФР"

	Дано Я открываю основную форму справочника "ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗамещениеГосударственныхМуниципальныхДолжностейПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиКалендаряПодготовкиОтчетности" 

	Дано Я открываю основную форму списка справочника "ЗаписиКалендаряПодготовкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиКалендаряПодготовкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиКалендаряПодготовкиОтчетности"

	Дано Я открываю основную форму справочника "ЗаписиКалендаряПодготовкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиКалендаряПодготовкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиКалендаряСотрудника" 

	Дано Я открываю основную форму списка справочника "ЗаписиКалендаряСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиКалендаряСотрудника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиКалендаряСотрудника"

	Дано Я открываю основную форму справочника "ЗаписиКалендаряСотрудника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиКалендаряСотрудника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЗаписиСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму справочника "ЗаписиСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаписиСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗарегистрированныеКассы" 

	Дано Я открываю основную форму списка справочника "ЗарегистрированныеКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗарегистрированныеКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗарегистрированныеКассы"

	Дано Я открываю основную форму справочника "ЗарегистрированныеКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗарегистрированныеКассы"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "ЗаявлениеОНазначенииПенсии" 

	Дано Я открываю основную форму списка справочника "ЗаявлениеОНазначенииПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОНазначенииПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеОНазначенииПенсии"

	Дано Я открываю основную форму справочника "ЗаявлениеОНазначенииПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗаявлениеОНазначенииПенсии"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ЗначенияКатегорийНовостей" 

	Дано Я открываю основную форму списка справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияКатегорийНовостей"

	Дано Я открываю основную форму справочника "ЗначенияКатегорийНовостей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияКатегорийНовостей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗоныТарифыДоставки" 

	Дано Я открываю основную форму списка справочника "ЗоныТарифыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗоныТарифыДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗоныТарифыДоставки"

	Дано Я открываю основную форму справочника "ЗоныТарифыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗоныТарифыДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыСервисовСопровождения" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыСервисовСопровождения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИдентификаторыСервисовСопровождения"

	Дано Я открываю основную форму справочника "ИдентификаторыСервисовСопровождения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыСервисовСопровождения"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ИнтервалыДоставки" 

	Дано Я открываю основную форму списка справочника "ИнтервалыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнтервалыДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнтервалыДоставки"

	Дано Я открываю основную форму справочника "ИнтервалыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнтервалыДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнформационныеСсылкиДляФорм" 

	Дано Я открываю основную форму списка справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнформационныеСсылкиДляФорм"

	Дано Я открываю основную форму справочника "ИнформационныеСсылкиДляФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИнформационныеСсылкиДляФорм"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсторияПроверкиИКорректировкиДанных" 

	Дано Я открываю основную форму списка справочника "ИсторияПроверкиИКорректировкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсторияПроверкиИКорректировкиДанных"

	Дано Я открываю основную форму справочника "ИсторияПроверкиИКорректировкиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсторияПроверкиИКорректировкиДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсточникиПривлеченияПокупателей" 

	Дано Я открываю основную форму списка справочника "ИсточникиПривлеченияПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиПривлеченияПокупателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсточникиПривлеченияПокупателей"

	Дано Я открываю основную форму справочника "ИсточникиПривлеченияПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИсточникиПривлеченияПокупателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Календари" 

	Дано Я открываю основную форму списка справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Календари"

	Дано Я открываю основную форму справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КалендариСотрудников" 

	Дано Я открываю основную форму списка справочника "КалендариСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КалендариСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КалендариСотрудников"

	Дано Я открываю основную форму справочника "КалендариСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КалендариСотрудников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КалендарьПерсональныхЗадачОтчетности" 

	Дано Я открываю основную форму списка справочника "КалендарьПерсональныхЗадачОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КалендарьПерсональныхЗадачОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КалендарьПерсональныхЗадачОтчетности"

	Дано Я открываю основную форму справочника "КалендарьПерсональныхЗадачОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КалендарьПерсональныхЗадачОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КалендарьПодготовкиОтчетности" 

	Дано Я открываю основную форму списка справочника "КалендарьПодготовкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КалендарьПодготовкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КалендарьПодготовкиОтчетности"

	Дано Я открываю основную форму справочника "КалендарьПодготовкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КалендарьПодготовкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Кассы" 

	Дано Я открываю основную форму списка справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Кассы"

	Дано Я открываю основную форму справочника "Кассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Кассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассыККМ" 

	Дано Я открываю основную форму списка справочника "КассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассыККМ"

	Дано Я открываю основную форму справочника "КассыККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассыККММП" 

	Дано Я открываю основную форму списка справочника "КассыККММП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККММП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассыККММП"

	Дано Я открываю основную форму справочника "КассыККММП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КассыККММП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КатегорииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "КатегорииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КатегорииНоменклатуры"

	Дано Я открываю основную форму справочника "КатегорииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КатегорииНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторАлкогольнойПродукцииЕГАИС" 

	Дано Я открываю основную форму списка справочника "КлассификаторАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму справочника "КлассификаторАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторБанков" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторБанков"

	Дано Я открываю основную форму справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторЕдиницИзмерения" 

	Дано Я открываю основную форму списка справочника "КлассификаторЕдиницИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторЕдиницИзмерения"

	Дано Я открываю основную форму справочника "КлассификаторЕдиницИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторКонтактов" 

	Дано Я открываю основную форму списка справочника "КлассификаторКонтактов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторКонтактов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторКонтактов"

	Дано Я открываю основную форму справочника "КлассификаторКонтактов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторКонтактов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторОрганизацийЕГАИС" 

	Дано Я открываю основную форму списка справочника "КлассификаторОрганизацийЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОрганизацийЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторОрганизацийЕГАИС"

	Дано Я открываю основную форму справочника "КлассификаторОрганизацийЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторОрганизацийЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторТНВЭД" 

	Дано Я открываю основную форму списка справочника "КлассификаторТНВЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторТНВЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлассификаторТНВЭД"

	Дано Я открываю основную форму справочника "КлассификаторТНВЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторТНВЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

	

	

	Дано Я открываю основную форму списка справочника "КлючиДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючиДоступа"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "КодыДоходовНДФЛ" 

	Дано Я открываю основную форму списка справочника "КодыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыДоходовНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КодыДоходовНДФЛ"

	Дано Я открываю основную форму справочника "КодыДоходовНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КодыДоходовНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Комиссии" 

	Дано Я открываю основную форму списка справочника "Комиссии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Комиссии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Комиссии"

	Дано Я открываю основную форму справочника "Комиссии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Комиссии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КомплектыОтчетностиПерсучета" 

	Дано Я открываю основную форму списка справочника "КомплектыОтчетностиПерсучета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсучета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КомплектыОтчетностиПерсучета"

	Дано Я открываю основную форму справочника "КомплектыОтчетностиПерсучета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КомплектыОтчетностиПерсучета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтактныеЛица" 

	Дано Я открываю основную форму списка справочника "КонтактныеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтактныеЛица"

	Дано Я открываю основную форму справочника "КонтактныеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтактныеЛица"
	И Я закрываю текущее окно

	
	
Сценарий: Открытие формы списка "Контрагенты" 

	Дано Я открываю основную форму списка справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Контрагенты"

	Дано Я открываю основную форму справочника "Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КонтрагентыМП" 

	Дано Я открываю основную форму списка справочника "КонтрагентыМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтрагентыМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КонтрагентыМП"

	Дано Я открываю основную форму справочника "КонтрагентыМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КонтрагентыМП"
	И Я закрываю текущее окно

	

	

	
Сценарий: Открытие формы списка "Лиды" 

	Дано Я открываю основную форму списка справочника "Лиды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Лиды"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Лиды"

	Дано Я открываю основную форму справочника "Лиды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Лиды"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ЛицензииПоставщиковАлкогольнойПродукции" 

	Дано Я открываю основную форму списка справочника "ЛицензииПоставщиковАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензииПоставщиковАлкогольнойПродукции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛицензииПоставщиковАлкогольнойПродукции"

	Дано Я открываю основную форму справочника "ЛицензииПоставщиковАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензииПоставщиковАлкогольнойПродукции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЛицензионныеКарточкиТранспортныхСредств" 

	Дано Я открываю основную форму списка справочника "ЛицензионныеКарточкиТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензионныеКарточкиТранспортныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЛицензионныеКарточкиТранспортныхСредств"

	Дано Я открываю основную форму справочника "ЛицензионныеКарточкиТранспортныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЛицензионныеКарточкиТранспортныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МакетыПенсионныхДел" 

	Дано Я открываю основную форму списка справочника "МакетыПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДел"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МакетыПенсионныхДел"

	Дано Я открываю основную форму справочника "МакетыПенсионныхДел"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МакетыПенсионныхДел"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника" 

	Дано Я открываю основную форму списка справочника "МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника"

	Дано Я открываю основную форму справочника "МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаппингПолейЗагрузкиДанныхИзВнешнегоИсточника"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутыПодписания" 

	Дано Я открываю основную форму списка справочника "МаршрутыПодписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутыПодписания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутыПодписания"

	Дано Я открываю основную форму справочника "МаршрутыПодписания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника МаршрутыПодписания"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "НаборыГруппДоступа" 

	Дано Я открываю основную форму списка справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыГруппДоступа"

	Дано Я открываю основную форму справочника "НаборыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "НалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НалоговыеОрганы"

	Дано Я открываю основную форму справочника "НалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияДеятельности" 

	Дано Я открываю основную форму списка справочника "НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияДеятельности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияДеятельности"

	Дано Я открываю основную форму справочника "НаправленияДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияДеятельности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаправленияСдачиОтчетности" 

	Дано Я открываю основную форму списка справочника "НаправленияСдачиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияСдачиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НаправленияСдачиОтчетности"

	Дано Я открываю основную форму справочника "НаправленияСдачиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаправленияСдачиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиИнтеграцииCRM" 

	Дано Я открываю основную форму списка справочника "НастройкиИнтеграцииCRM"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиИнтеграцииCRM"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиИнтеграцииCRM"

	Дано Я открываю основную форму справочника "НастройкиИнтеграцииCRM"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиИнтеграцииCRM"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиНумерацииДоговоровКонтрагентов" 

	Дано Я открываю основную форму списка справочника "НастройкиНумерацииДоговоровКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиНумерацииДоговоровКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиНумерацииДоговоровКонтрагентов"

	Дано Я открываю основную форму справочника "НастройкиНумерацииДоговоровКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиНумерацииДоговоровКонтрагентов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиОбменСБанками" 

	Дано Я открываю основную форму списка справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиОбменСБанками"

	Дано Я открываю основную форму справочника "НастройкиОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиПубликацииМЛК" 

	Дано Я открываю основную форму списка справочника "НастройкиПубликацииМЛК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиПубликацииМЛК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиПубликацииМЛК"

	Дано Я открываю основную форму справочника "НастройкиПубликацииМЛК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиПубликацииМЛК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРассылкиСостояниеКомпании" 

	Дано Я открываю основную форму списка справочника "НастройкиРассылкиСостояниеКомпании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРассылкиСостояниеКомпании"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРассылкиСостояниеКомпании"

	Дано Я открываю основную форму справочника "НастройкиРассылкиСостояниеКомпании"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРассылкиСостояниеКомпании"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиРМК" 

	Дано Я открываю основную форму списка справочника "НастройкиРМК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРМК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиРМК"

	Дано Я открываю основную форму справочника "НастройкиРМК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиРМК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЭДО" 

	Дано Я открываю основную форму списка справочника "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЭДО"

	Дано Я открываю основную форму справочника "НастройкиЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЯндексДоставки" 

	Дано Я открываю основную форму списка справочника "НастройкиЯндексДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЯндексДоставки"

	Дано Я открываю основную форму справочника "НастройкиЯндексДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НастройкиЯндексКассы" 

	Дано Я открываю основную форму списка справочника "НастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НастройкиЯндексКассы"

	Дано Я открываю основную форму справочника "НастройкиЯндексКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НастройкиЯндексКассы"
	И Я закрываю текущее окно




	
Сценарий: Открытие формы списка "Номенклатура" 

	Дано Я открываю основную форму списка справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Номенклатура"

	Дано Я открываю основную форму справочника "Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Номенклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НоменклатураПоставщиков" 

	Дано Я открываю основную форму списка справочника "НоменклатураПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПоставщиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НоменклатураПоставщиков"

	Дано Я открываю основную форму справочника "НоменклатураПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НоменклатураПоставщиков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НомераГТД" 

	Дано Я открываю основную форму списка справочника "НомераГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НомераГТД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НомераГТД"

	Дано Я открываю основную форму справочника "НомераГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НомераГТД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ОбщиеВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбщиеДанныеИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбщиеДанныеИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ОбщиеДанныеИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОбщиеДанныеИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОКУН" 

	Дано Я открываю основную форму списка справочника "ОКУН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОКУН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОКУН"

	Дано Я открываю основную форму справочника "ОКУН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОКУН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписиВходящихДокументовИзНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "ОписиВходящихДокументовИзНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиВходящихДокументовИзНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписиВходящихДокументовИзНалоговыхОрганов"

	Дано Я открываю основную форму справочника "ОписиВходящихДокументовИзНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиВходящихДокументовИзНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписиИсходящихДокументовВНалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "ОписиИсходящихДокументовВНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиИсходящихДокументовВНалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписиИсходящихДокументовВНалоговыеОрганы"

	Дано Я открываю основную форму справочника "ОписиИсходящихДокументовВНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОписиИсходящихДокументовВНалоговыеОрганы"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "Организации" 

	Дано Я открываю основную форму списка справочника "Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Организации"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "ОрганыПФР" 

	Дано Я открываю основную форму списка справочника "ОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганыПФР"

	Дано Я открываю основную форму справочника "ОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОрганыФСГС" 

	Дано Я открываю основную форму списка справочника "ОрганыФСГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыФСГС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОрганыФСГС"

	Дано Я открываю основную форму справочника "ОрганыФСГС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОрганыФСГС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияДосрочногоНазначенияПенсии" 

	Дано Я открываю основную форму списка справочника "ОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияДосрочногоНазначенияПенсии"

	Дано Я открываю основную форму справочника "ОснованияДосрочногоНазначенияПенсии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсии"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияДосрочногоНазначенияПенсииДляСЗВК" 

	Дано Я открываю основную форму списка справочника "ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияДосрочногоНазначенияПенсииДляСЗВК"

	Дано Я открываю основную форму справочника "ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияДосрочногоНазначенияПенсииДляСЗВК"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОснованияИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "ОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОснованияИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "ОснованияИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОснованияИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсобыеУсловияТрудаДляСЗВКПФР" 

	Дано Я открываю основную форму списка справочника "ОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсобыеУсловияТрудаДляСЗВКПФР"

	Дано Я открываю основную форму справочника "ОсобыеУсловияТрудаДляСЗВКПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаДляСЗВКПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОсобыеУсловияТрудаПФР" 

	Дано Я открываю основную форму списка справочника "ОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОсобыеУсловияТрудаПФР"

	Дано Я открываю основную форму справочника "ОсобыеУсловияТрудаПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОсобыеУсловияТрудаПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиОтчетности" 

	Дано Я открываю основную форму списка справочника "ОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиОтчетности"

	Дано Я открываю основную форму справочника "ОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиРПН" 

	Дано Я открываю основную форму списка справочника "ОтправкиРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРПН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиРПН"

	Дано Я открываю основную форму справочника "ОтправкиРПН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиРПН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиФСРАР" 

	Дано Я открываю основную форму списка справочника "ОтправкиФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСРАР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиФСРАР"

	Дано Я открываю основную форму справочника "ОтправкиФСРАР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСРАР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиФСС" 

	Дано Я открываю основную форму списка справочника "ОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиФСС"

	Дано Я открываю основную форму справочника "ОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтправкиФТС" 

	Дано Я открываю основную форму списка справочника "ОтправкиФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФТС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтправкиФТС"

	Дано Я открываю основную форму справочника "ОтправкиФТС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОтправкиФТС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданий"

	Дано Я открываю основную форму справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданийОбластейДанных" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЗаданийОбластейДанных"

	Дано Я открываю основную форму справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЭлектронныхЧековКОтправке" 

	Дано Я открываю основную форму списка справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОчередьЭлектронныхЧековКОтправке"

	Дано Я открываю основную форму справочника "ОчередьЭлектронныхЧековКОтправке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЭлектронныхЧековКОтправке"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыИсчисляемогоСтраховогоСтажа" 

	Дано Я открываю основную форму списка справочника "ПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыИсчисляемогоСтраховогоСтажа"

	Дано Я открываю основную форму справочника "ПараметрыИсчисляемогоСтраховогоСтажа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыИсчисляемогоСтраховогоСтажа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРасчетов" 

	Дано Я открываю основную форму списка справочника "ПараметрыРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыРасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРасчетов"

	Дано Я открываю основную форму справочника "ПараметрыРасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыРасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПараметрыРасчетовДоставки" 

	Дано Я открываю основную форму списка справочника "ПараметрыРасчетовДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыРасчетовДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПараметрыРасчетовДоставки"

	Дано Я открываю основную форму справочника "ПараметрыРасчетовДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПараметрыРасчетовДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПартииНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ПартииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПартииНоменклатуры"

	Дано Я открываю основную форму справочника "ПартииНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПартииНоменклатуры"
	И Я закрываю текущее окно

	


	
Сценарий: Открытие формы списка "Патенты" 

	Дано Я открываю основную форму списка справочника "Патенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Патенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Патенты"

	Дано Я открываю основную форму справочника "Патенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Патенты"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "ПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "ПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "Подписи" 

	Дано Я открываю основную форму списка справочника "Подписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Подписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Подписи"

	Дано Я открываю основную форму справочника "Подписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Подписи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиБизнеса" 

	Дано Я открываю основную форму списка справочника "ПоказателиБизнеса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиБизнеса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиБизнеса"

	Дано Я открываю основную форму справочника "ПоказателиБизнеса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоказателиБизнеса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПолныеПутиКФормам" 

	Дано Я открываю основную форму списка справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПолныеПутиКФормам"

	Дано Я открываю основную форму справочника "ПолныеПутиКФормам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПолныеПутиКФормам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПользователиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиВЕТИС"

	Дано Я открываю основную форму справочника "ПользователиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользователиМП" 

	Дано Я открываю основную форму списка справочника "ПользователиМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользователиМП"

	Дано Я открываю основную форму справочника "ПользователиМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользователиМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанные" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеДанные"

	Дано Я открываю основную форму справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "ПоставляемыеРасширения" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставляемыеРасширения"

	Дано Я открываю основную форму справочника "ПоставляемыеРасширения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеРасширения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставщикиУслугСервиса" 

	Дано Я открываю основную форму списка справочника "ПоставщикиУслугСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставщикиУслугСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоставщикиУслугСервиса"

	Дано Я открываю основную форму справочника "ПоставщикиУслугСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставщикиУслугСервиса"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ПравилаОбменаСПодключаемымОборудованиемOffline" 

	Дано Я открываю основную форму списка справочника "ПравилаОбменаСПодключаемымОборудованиемOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбменаСПодключаемымОборудованиемOffline"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаОбменаСПодключаемымОборудованиемOffline"

	Дано Я открываю основную форму справочника "ПравилаОбменаСПодключаемымОборудованиемOffline"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбменаСПодключаемымОборудованиемOffline"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаРабочегоПроцесса" 

	Дано Я открываю основную форму списка справочника "ПравилаРабочегоПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаРабочегоПроцесса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПравилаРабочегоПроцесса"

	Дано Я открываю основную форму справочника "ПравилаРабочегоПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаРабочегоПроцесса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрайсЛисты" 

	Дано Я открываю основную форму списка справочника "ПрайсЛисты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрайсЛисты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрайсЛисты"

	Дано Я открываю основную форму справочника "ПрайсЛисты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрайсЛисты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрайсЛистыКонтрагентов" 

	Дано Я открываю основную форму списка справочника "ПрайсЛистыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрайсЛистыКонтрагентов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрайсЛистыКонтрагентов"

	Дано Я открываю основную форму справочника "ПрайсЛистыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрайсЛистыКонтрагентов"
	И Я закрываю текущее окно

	



	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредприятияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПредприятияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредприятияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПредприятияВЕТИС"

	Дано Я открываю основную форму справочника "ПредприятияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредприятияВЕТИС"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ПричиныНеуспешногоЗавершенияРаботыСЛидом" 

	Дано Я открываю основную форму списка справочника "ПричиныНеуспешногоЗавершенияРаботыСЛидом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныНеуспешногоЗавершенияРаботыСЛидом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныНеуспешногоЗавершенияРаботыСЛидом"

	Дано Я открываю основную форму справочника "ПричиныНеуспешногоЗавершенияРаботыСЛидом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныНеуспешногоЗавершенияРаботыСЛидом"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПричиныОтменыЗаказа" 

	Дано Я открываю основную форму списка справочника "ПричиныОтменыЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПричиныОтменыЗаказа"

	Дано Я открываю основную форму справочника "ПричиныОтменыЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПричиныОтменыЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПродукцияВЕТИС" 

	Дано Я открываю основную форму списка справочника "ПродукцияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродукцияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПродукцияВЕТИС"

	Дано Я открываю основную форму справочника "ПродукцияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПродукцияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Проекты" 

	Дано Я открываю основную форму списка справочника "Проекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Проекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Проекты"

	Дано Я открываю основную форму справочника "Проекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Проекты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиКлючевыхОпераций" 

	Дано Я открываю основную форму списка справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрофилиКлючевыхОпераций"

	Дано Я открываю основную форму справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПунктыВыдачиЗаказа" 

	Дано Я открываю основную форму списка справочника "ПунктыВыдачиЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПунктыВыдачиЗаказа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПунктыВыдачиЗаказа"

	Дано Я открываю основную форму справочника "ПунктыВыдачиЗаказа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПунктыВыдачиЗаказа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РабочиеМеста" 

	Дано Я открываю основную форму списка справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РабочиеМеста"

	Дано Я открываю основную форму справочника "РабочиеМеста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РабочиеМеста"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

	



	
Сценарий: Открытие формы списка "РолиКонтактныхЛиц" 

	Дано Я открываю основную форму списка справочника "РолиКонтактныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РолиКонтактныхЛиц"

	Дано Я открываю основную форму справочника "РолиКонтактныхЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиКонтактныхЛиц"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "СерийныеНомера" 

	Дано Я открываю основную форму списка справочника "СерийныеНомера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерийныеНомера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СерийныеНомера"

	Дано Я открываю основную форму справочника "СерийныеНомера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СерийныеНомера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сертификаты1СОтчетности" 

	Дано Я открываю основную форму списка справочника "Сертификаты1СОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сертификаты1СОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сертификаты1СОтчетности"

	Дано Я открываю основную форму справочника "Сертификаты1СОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сертификаты1СОтчетности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СертификатыКлючейЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СканированныеДокументыДляПередачиВЭлектронномВиде" 

	Дано Я открываю основную форму списка справочника "СканированныеДокументыДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СканированныеДокументыДляПередачиВЭлектронномВиде"

	Дано Я открываю основную форму справочника "СканированныеДокументыДляПередачиВЭлектронномВиде"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СканированныеДокументыДляПередачиВЭлектронномВиде"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "СкладыСлужбДоставки" 

	Дано Я открываю основную форму списка справочника "СкладыСлужбДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладыСлужбДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СкладыСлужбДоставки"

	Дано Я открываю основную форму справочника "СкладыСлужбДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СкладыСлужбДоставки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СлужбыДоставки" 

	Дано Я открываю основную форму списка справочника "СлужбыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СлужбыДоставки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СлужбыДоставки"

	Дано Я открываю основную форму справочника "СлужбыДоставки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СлужбыДоставки"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "СобытияОтправкиОтчетности" 

	Дано Я открываю основную форму списка справочника "СобытияОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОтправкиОтчетности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СобытияОтправкиОтчетности"

	Дано Я открываю основную форму справочника "СобытияОтправкиОтчетности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СобытияОтправкиОтчетности"
	И Я закрываю текущее окно

	
	
Сценарий: Открытие формы списка "СообщенияОбластейДанных" 

	Дано Я открываю основную форму списка справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбластейДанных"

	Дано Я открываю основную форму справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбсуждений" 

	Дано Я открываю основную форму списка справочника "СообщенияОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбсуждений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияОбсуждений"

	Дано Я открываю основную форму справочника "СообщенияОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбсуждений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияСистемы" 

	Дано Я открываю основную форму списка справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщенияСистемы"

	Дано Я открываю основную форму справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СоответствияНазначенийПлатежаИРеквизитовПлатежа" 

	Дано Я открываю основную форму списка справочника "СоответствияНазначенийПлатежаИРеквизитовПлатежа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоответствияНазначенийПлатежаИРеквизитовПлатежа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СоответствияНазначенийПлатежаИРеквизитовПлатежа"

	Дано Я открываю основную форму справочника "СоответствияНазначенийПлатежаИРеквизитовПлатежа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СоответствияНазначенийПлатежаИРеквизитовПлатежа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказНарядов" 

	Дано Я открываю основную форму списка справочника "СостоянияЗаказНарядов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказНарядов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказНарядов"

	Дано Я открываю основную форму справочника "СостоянияЗаказНарядов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказНарядов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовНаПроизводство" 

	Дано Я открываю основную форму списка справочника "СостоянияЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказовНаПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовНаПроизводство"

	Дано Я открываю основную форму справочника "СостоянияЗаказовНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказовНаПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовПокупателей" 

	Дано Я открываю основную форму списка справочника "СостоянияЗаказовПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказовПокупателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовПокупателей"

	Дано Я открываю основную форму справочника "СостоянияЗаказовПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказовПокупателей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЗаказовПоставщикам" 

	Дано Я открываю основную форму списка справочника "СостоянияЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказовПоставщикам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЗаказовПоставщикам"

	Дано Я открываю основную форму справочника "СостоянияЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЗаказовПоставщикам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияЛидов" 

	Дано Я открываю основную форму списка справочника "СостоянияЛидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЛидов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияЛидов"

	Дано Я открываю основную форму справочника "СостоянияЛидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияЛидов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СостоянияСобытий" 

	Дано Я открываю основную форму списка справочника "СостоянияСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияСобытий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СостоянияСобытий"

	Дано Я открываю основную форму справочника "СостоянияСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СостоянияСобытий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Сотрудники" 

	Дано Я открываю основную форму списка справочника "Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Сотрудники"

	Дано Я открываю основную форму справочника "Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Сотрудники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Спецификации" 

	Дано Я открываю основную форму списка справочника "Спецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Спецификации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Спецификации"

	Дано Я открываю основную форму справочника "Спецификации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Спецификации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СпецификацииМП" 

	Дано Я открываю основную форму списка справочника "СпецификацииМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпецификацииМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпецификацииМП"

	Дано Я открываю основную форму справочника "СпецификацииМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпецификацииМП"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения" 

	Дано Я открываю основную форму списка справочника "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"

	Дано Я открываю основную форму справочника "СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Справки1ЕГАИС" 

	Дано Я открываю основную форму списка справочника "Справки1ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки1ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Справки1ЕГАИС"

	Дано Я открываю основную форму справочника "Справки1ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки1ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Справки2ЕГАИС" 

	Дано Я открываю основную форму списка справочника "Справки2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Справки2ЕГАИС"

	Дано Я открываю основную форму справочника "Справки2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Справки2ЕГАИС"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "СтавкиНДС" 

	Дано Я открываю основную форму списка справочника "СтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтавкиНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНДС"

	Дано Я открываю основную форму справочника "СтавкиНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтавкиНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтавкиНДСМП" 

	Дано Я открываю основную форму списка справочника "СтавкиНДСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтавкиНДСМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтавкиНДСМП"

	Дано Я открываю основную форму справочника "СтавкиНДСМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтавкиНДСМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиДвиженияДенежныхСредств" 

	Дано Я открываю основную форму списка справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиДвиженияДенежныхСредств"

	Дано Я открываю основную форму справочника "СтатьиДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиДвиженияДенежныхСредств"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтатьиМП" 

	Дано Я открываю основную форму списка справочника "СтатьиМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтатьиМП"

	Дано Я открываю основную форму справочника "СтатьиМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтатьиМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктурныеЕдиницы" 

	Дано Я открываю основную форму списка справочника "СтруктурныеЕдиницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктурныеЕдиницы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктурныеЕдиницы"

	Дано Я открываю основную форму справочника "СтруктурныеЕдиницы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктурныеЕдиницы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтруктурныеЕдиницыМП" 

	Дано Я открываю основную форму списка справочника "СтруктурныеЕдиницыМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктурныеЕдиницыМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СтруктурныеЕдиницыМП"

	Дано Я открываю основную форму справочника "СтруктурныеЕдиницыМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтруктурныеЕдиницыМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииПланирования" 

	Дано Я открываю основную форму списка справочника "СценарииПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииПланирования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СценарииПланирования"

	Дано Я открываю основную форму справочника "СценарииПланирования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииПланирования"
	И Я закрываю текущее окно

	
	
Сценарий: Открытие формы списка "ТарифныеПланыДоговоровОбслуживания" 

	Дано Я открываю основную форму списка справочника "ТарифныеПланыДоговоровОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифныеПланыДоговоровОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТарифныеПланыДоговоровОбслуживания"

	Дано Я открываю основную форму справочника "ТарифныеПланыДоговоровОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТарифныеПланыДоговоровОбслуживания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Теги" 

	Дано Я открываю основную форму списка справочника "Теги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Теги"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Теги"

	Дано Я открываю основную форму справочника "Теги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Теги"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТегиОтчетов" 

	Дано Я открываю основную форму списка справочника "ТегиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТегиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТегиОтчетов"

	Дано Я открываю основную форму справочника "ТегиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТегиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТемыСобытий" 

	Дано Я открываю основную форму списка справочника "ТемыСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТемыСобытий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТемыСобытий"

	Дано Я открываю основную форму справочника "ТемыСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТемыСобытий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТерриториальныеУсловияПФР" 

	Дано Я открываю основную форму списка справочника "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТерриториальныеУсловияПФР"

	Дано Я открываю основную форму справочника "ТерриториальныеУсловияПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТерриториальныеУсловияПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыИнформацииИнформационногоЦентра" 

	Дано Я открываю основную форму списка справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыИнформацииИнформационногоЦентра"

	Дано Я открываю основную форму справочника "ТипыИнформацииИнформационногоЦентра"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыИнформацииИнформационногоЦентра"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыПисемОбменСБанками" 

	Дано Я открываю основную форму списка справочника "ТипыПисемОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПисемОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыПисемОбменСБанками"

	Дано Я открываю основную форму справочника "ТипыПисемОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыПисемОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТипыСобытийСПАРКРиски" 

	Дано Я открываю основную форму списка справочника "ТипыСобытийСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыСобытийСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТипыСобытийСПАРКРиски"

	Дано Я открываю основную форму справочника "ТипыСобытийСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТипыСобытийСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТоварыМП" 

	Дано Я открываю основную форму списка справочника "ТоварыМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТоварыМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТоварыМП"

	Дано Я открываю основную форму справочника "ТоварыМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТоварыМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТорговыеПредложения" 

	Дано Я открываю основную форму списка справочника "ТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТорговыеПредложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТорговыеПредложения"

	Дано Я открываю основную форму справочника "ТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТорговыеПредложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТорговыеТочки" 

	Дано Я открываю основную форму списка справочника "ТорговыеТочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТорговыеТочки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТорговыеТочки"

	Дано Я открываю основную форму справочника "ТорговыеТочки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТорговыеТочки"
	И Я закрываю текущее окно

	

Сценарий: Открытие формы списка "УдалитьВидыАлкогольнойПродукцииЕГАИС" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму справочника "УдалитьВидыАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыНалоговыхОрганов"

	Дано Я открываю основную форму справочника "УдалитьВидыНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОбъектовЕГАИС" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОбъектовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбъектовЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОбъектовЕГАИС"

	Дано Я открываю основную форму справочника "УдалитьВидыОбъектовЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОбъектовЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьВидыОтправляемыхДокументов" 

	Дано Я открываю основную форму списка справочника "УдалитьВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьВидыОтправляемыхДокументов"

	Дано Я открываю основную форму справочника "УдалитьВидыОтправляемыхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьВидыОтправляемыхДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДанныеОбменаШтрихМПЭЙ" 

	Дано Я открываю основную форму списка справочника "УдалитьДанныеОбменаШтрихМПЭЙ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДанныеОбменаШтрихМПЭЙ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДанныеОбменаШтрихМПЭЙ"

	Дано Я открываю основную форму справочника "УдалитьДанныеОбменаШтрихМПЭЙ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДанныеОбменаШтрихМПЭЙ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов" 

	Дано Я открываю основную форму списка справочника "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"

	Дано Я открываю основную форму справочника "УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьДокументыРеализацииПолномочийНалоговыхОрганов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКлассификаторКатегорийНоменклатуры" 

	Дано Я открываю основную форму списка справочника "УдалитьКлассификаторКатегорийНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКлассификаторКатегорийНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКлассификаторКатегорийНоменклатуры"

	Дано Я открываю основную форму справочника "УдалитьКлассификаторКатегорийНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьКлассификаторКатегорийНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьНалоговыеОрганы" 

	Дано Я открываю основную форму списка справочника "УдалитьНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНалоговыеОрганы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьНалоговыеОрганы"

	Дано Я открываю основную форму справочника "УдалитьНалоговыеОрганы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьНалоговыеОрганы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОрганыПФР" 

	Дано Я открываю основную форму списка справочника "УдалитьОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОрганыПФР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОрганыПФР"

	Дано Я открываю основную форму справочника "УдалитьОрганыПФР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОрганыПФР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьОтправкиФСС" 

	Дано Я открываю основную форму списка справочника "УдалитьОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОтправкиФСС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьОтправкиФСС"

	Дано Я открываю основную форму справочника "УдалитьОтправкиФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьОтправкиФСС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПапкиФайловПрисоединенныеУдалитьФайлы" 

	Дано Я открываю основную форму списка справочника "УдалитьПапкиФайловПрисоединенныеУдалитьФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПапкиФайловПрисоединенныеУдалитьФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПапкиФайловПрисоединенныеУдалитьФайлы"

	Дано Я открываю основную форму справочника "УдалитьПапкиФайловПрисоединенныеУдалитьФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПапкиФайловПрисоединенныеУдалитьФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПерепискаСКонтролирующимиОрганами" 

	Дано Я открываю основную форму списка справочника "УдалитьПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПерепискаСКонтролирующимиОрганами"

	Дано Я открываю основную форму справочника "УдалитьПерепискаСКонтролирующимиОрганами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПерепискаСКонтролирующимиОрганами"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПрофилиНастроекЭДО" 

	Дано Я открываю основную форму списка справочника "УдалитьПрофилиНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПрофилиНастроекЭДО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПрофилиНастроекЭДО"

	Дано Я открываю основную форму справочника "УдалитьПрофилиНастроекЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьПрофилиНастроекЭДО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьРегламентированныеОтчеты" 

	Дано Я открываю основную форму списка справочника "УдалитьРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьРегламентированныеОтчеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьРегламентированныеОтчеты"

	Дано Я открываю основную форму справочника "УдалитьРегламентированныеОтчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьРегламентированныеОтчеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСерверыДокументооборота" 

	Дано Я открываю основную форму списка справочника "УдалитьСерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСерверыДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСерверыДокументооборота"

	Дано Я открываю основную форму справочника "УдалитьСерверыДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСерверыДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСертификатыЭП" 

	Дано Я открываю основную форму списка справочника "УдалитьСертификатыЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСертификатыЭП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСертификатыЭП"

	Дано Я открываю основную форму справочника "УдалитьСертификатыЭП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСертификатыЭП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьСоглашенияОбИспользованииЭД" 

	Дано Я открываю основную форму списка справочника "УдалитьСоглашенияОбИспользованииЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСоглашенияОбИспользованииЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьСоглашенияОбИспользованииЭД"

	Дано Я открываю основную форму справочника "УдалитьСоглашенияОбИспользованииЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьСоглашенияОбИспользованииЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьУчетныеЗаписиДокументооборота" 

	Дано Я открываю основную форму списка справочника "УдалитьУчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьУчетныеЗаписиДокументооборота"

	Дано Я открываю основную форму справочника "УдалитьУчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьУчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка справочника "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"

	Дано Я открываю основную форму справочника "УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УдалитьЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УпаковкиВЕТИС" 

	Дано Я открываю основную форму списка справочника "УпаковкиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УпаковкиВЕТИС"

	Дано Я открываю основную форму справочника "УпаковкиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УпаковкиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияПредоставленияСкидокНаценок" 

	Дано Я открываю основную форму списка справочника "УсловияПредоставленияСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияПредоставленияСкидокНаценок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияПредоставленияСкидокНаценок"

	Дано Я открываю основную форму справочника "УсловияПредоставленияСкидокНаценок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияПредоставленияСкидокНаценок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УсловияРегионализацииВЕТИС" 

	Дано Я открываю основную форму списка справочника "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УсловияРегионализацииВЕТИС"

	Дано Я открываю основную форму справочника "УсловияРегионализацииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УсловияРегионализацииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УслугиСервиса" 

	Дано Я открываю основную форму списка справочника "УслугиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиСервиса"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УслугиСервиса"

	Дано Я открываю основную форму справочника "УслугиСервиса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УслугиСервиса"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиДокументооборота" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиДокументооборота"

	Дано Я открываю основную форму справочника "УчетныеЗаписиДокументооборота"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиДокументооборота"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ФизическиеЛица"

	Дано Я открываю основную форму справочника "ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ФизическиеЛица"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ХарактеристикиНоменклатуры" 

	Дано Я открываю основную форму списка справочника "ХарактеристикиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХарактеристикиНоменклатуры"

	Дано Я открываю основную форму справочника "ХарактеристикиНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХарактеристикиНоменклатуры"
	И Я закрываю текущее окно


	
Сценарий: Открытие формы списка "ХозяйственныеОперации" 

	Дано Я открываю основную форму списка справочника "ХозяйственныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйственныеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХозяйственныеОперации"

	Дано Я открываю основную форму справочника "ХозяйственныеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйственныеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХозяйствующиеСубъектыВЕТИС" 

	Дано Я открываю основную форму списка справочника "ХозяйствующиеСубъектыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйствующиеСубъектыВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХозяйствующиеСубъектыВЕТИС"

	Дано Я открываю основную форму справочника "ХозяйствующиеСубъектыВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХозяйствующиеСубъектыВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранилищеШаблонов" 

	Дано Я открываю основную форму списка справочника "ХранилищеШаблонов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранилищеШаблонов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ХранилищеШаблонов"

	Дано Я открываю основную форму справочника "ХранилищеШаблонов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранилищеШаблонов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦелиВЕТИС" 

	Дано Я открываю основную форму списка справочника "ЦелиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелиВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦелиВЕТИС"

	Дано Я открываю основную форму справочника "ЦелиВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦелиВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦеновыеГруппы" 

	Дано Я открываю основную форму списка справочника "ЦеновыеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦеновыеГруппы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦеновыеГруппы"

	Дано Я открываю основную форму справочника "ЦеновыеГруппы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦеновыеГруппы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЦиклыОбмена" 

	Дано Я открываю основную форму списка справочника "ЦиклыОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦиклыОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЦиклыОбмена"

	Дано Я открываю основную форму справочника "ЦиклыОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЦиклыОбмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныДисконтныхКарт" 

	Дано Я открываю основную форму списка справочника "ШаблоныДисконтныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныДисконтныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныДисконтныхКарт"

	Дано Я открываю основную форму справочника "ШаблоныДисконтныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныДисконтныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныДокументов" 

	Дано Я открываю основную форму списка справочника "ШаблоныДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныДокументов"

	Дано Я открываю основную форму справочника "ШаблоныДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЗаданийОчереди" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЗаданийОчереди"

	Дано Я открываю основную форму справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЗаполненияГрафиковРабочегоВремени" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаполненияГрафиковРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаполненияГрафиковРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЗаполненияГрафиковРабочегоВремени"

	Дано Я открываю основную форму справочника "ШаблоныЗаполненияГрафиковРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаполненияГрафиковРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныКалькуляций" 

	Дано Я открываю основную форму списка справочника "ШаблоныКалькуляций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныКалькуляций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныКалькуляций"

	Дано Я открываю основную форму справочника "ШаблоныКалькуляций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныКалькуляций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныМагнитныхКарт" 

	Дано Я открываю основную форму списка справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныМагнитныхКарт"

	Дано Я открываю основную форму справочника "ШаблоныМагнитныхКарт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныМагнитныхКарт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныНаименований" 

	Дано Я открываю основную форму списка справочника "ШаблоныНаименований"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныНаименований"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныНаименований"

	Дано Я открываю основную форму справочника "ШаблоныНаименований"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныНаименований"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныПечатиОфисныхДокументов" 

	Дано Я открываю основную форму списка справочника "ШаблоныПечатиОфисныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныПечатиОфисныхДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныПечатиОфисныхДокументов"

	Дано Я открываю основную форму справочника "ШаблоныПечатиОфисныхДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныПечатиОфисныхДокументов"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ШаблоныСерийныхНомеров" 

	Дано Я открываю основную форму списка справочника "ШаблоныСерийныхНомеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСерийныхНомеров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСерийныхНомеров"

	Дано Я открываю основную форму справочника "ШаблоныСерийныхНомеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСерийныхНомеров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

	
	
Сценарий: Открытие формы списка "ШаблоныЭтикетокИЦенников" 

	Дано Я открываю основную форму списка справочника "ШаблоныЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокИЦенников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШаблоныЭтикетокИЦенников"

	Дано Я открываю основную форму справочника "ШаблоныЭтикетокИЦенников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЭтикетокИЦенников"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШтрихкодыУпаковокТоваров" 

	Дано Я открываю основную форму списка справочника "ШтрихкодыУпаковокТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтрихкодыУпаковокТоваров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ШтрихкодыУпаковокТоваров"

	Дано Я открываю основную форму справочника "ШтрихкодыУпаковокТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШтрихкодыУпаковокТоваров"
	И Я закрываю текущее окно

	

	
Сценарий: Открытие формы списка "ЭквайринговыеТерминалы" 

	Дано Я открываю основную форму списка справочника "ЭквайринговыеТерминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭквайринговыеТерминалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭквайринговыеТерминалы"

	Дано Я открываю основную форму справочника "ЭквайринговыеТерминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭквайринговыеТерминалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныеПредставленияРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка справочника "ЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныеПредставленияРегламентированныхОтчетов"

	Дано Я открываю основную форму справочника "ЭлектронныеПредставленияРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронныеПредставленияРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапыПроизводства" 

	Дано Я открываю основную форму списка справочника "ЭтапыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПроизводства"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыПроизводства"

	Дано Я открываю основную форму справочника "ЭтапыПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыПроизводства"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭтапыРемонта" 

	Дано Я открываю основную форму списка справочника "ЭтапыРемонта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыРемонта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭтапыРемонта"

	Дано Я открываю основную форму справочника "ЭтапыРемонта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭтапыРемонта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Ячейки" 

	Дано Я открываю основную форму списка справочника "Ячейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Ячейки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Ячейки"

	Дано Я открываю основную форму справочника "Ячейки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Ячейки"
	И Я закрываю текущее окно

