
#language: ru

@tree
@SmokeTest
Функциональность: Дымовые тесты по документам

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	
Сценарий: Открытие формы списка "АвансовыйОтчет" 

	Дано Я открываю основную форму списка документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АвансовыйОтчет"

	Дано Я открываю основную форму документа "АвансовыйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АвансовыйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктВыполненныхРабот" 

	Дано Я открываю основную форму списка документа "АктВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктВыполненныхРабот"

	Дано Я открываю основную форму документа "АктВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктВыполненныхРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктПостановкиНаБалансЕГАИС" 

	Дано Я открываю основную форму списка документа "АктПостановкиНаБалансЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПостановкиНаБалансЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктПостановкиНаБалансЕГАИС"

	Дано Я открываю основную форму документа "АктПостановкиНаБалансЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктПостановкиНаБалансЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АктСписанияЕГАИС" 

	Дано Я открываю основную форму списка документа "АктСписанияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСписанияЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АктСписанияЕГАИС"

	Дано Я открываю основную форму документа "АктСписанияЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АктСписанияЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "АмортизацияВА" 

	Дано Я открываю основную форму списка документа "АмортизацияВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияВА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "АмортизацияВА"

	Дано Я открываю основную форму документа "АмортизацияВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа АмортизацияВА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Бюджет" 

	Дано Я открываю основную форму списка документа "Бюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюджет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Бюджет"

	Дано Я открываю основную форму документа "Бюджет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Бюджет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводНачальныхОстатков" 

	Дано Я открываю основную форму списка документа "ВводНачальныхОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводНачальныхОстатков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводНачальныхОстатков"

	Дано Я открываю основную форму документа "ВводНачальныхОстатков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводНачальныхОстатков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВводОстатковМП" 

	Дано Я открываю основную форму списка документа "ВводОстатковМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВводОстатковМП"

	Дано Я открываю основную форму документа "ВводОстатковМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВводОстатковМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Взаимозачет" 

	Дано Я открываю основную форму списка документа "Взаимозачет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Взаимозачет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Взаимозачет"

	Дано Я открываю основную форму документа "Взаимозачет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Взаимозачет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнесениеНаличных" 

	Дано Я открываю основную форму списка документа "ВнесениеНаличных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнесениеНаличных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВнесениеНаличных"

	Дано Я открываю основную форму документа "ВнесениеНаличных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВнесениеНаличных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВозвратИзРегистра2ЕГАИС" 

	Дано Я открываю основную форму списка документа "ВозвратИзРегистра2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРегистра2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВозвратИзРегистра2ЕГАИС"

	Дано Я открываю основную форму документа "ВозвратИзРегистра2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВозвратИзРегистра2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВходящаяТранспортнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ВходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВходящаяТранспортнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ВходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыгрузкаРегламентированныхОтчетов" 

	Дано Я открываю основную форму списка документа "ВыгрузкаРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыгрузкаРегламентированныхОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыгрузкаРегламентированныхОтчетов"

	Дано Я открываю основную форму документа "ВыгрузкаРегламентированныхОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыгрузкаРегламентированныхОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыемкаНаличных" 

	Дано Я открываю основную форму списка документа "ВыемкаНаличных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыемкаНаличных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыемкаНаличных"

	Дано Я открываю основную форму документа "ВыемкаНаличных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыемкаНаличных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВыработкаВА" 

	Дано Я открываю основную форму списка документа "ВыработкаВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыработкаВА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ВыработкаВА"

	Дано Я открываю основную форму документа "ВыработкаВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ВыработкаВА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР" 

	Дано Я открываю основную форму списка документа "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"

	Дано Я открываю основную форму документа "ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Доверенность" 

	Дано Я открываю основную форму списка документа "Доверенность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Доверенность"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Доверенность"

	Дано Я открываю основную форму документа "Доверенность"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Доверенность"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДоговорКредитаИЗайма" 

	Дано Я открываю основную форму списка документа "ДоговорКредитаИЗайма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорКредитаИЗайма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДоговорКредитаИЗайма"

	Дано Я открываю основную форму документа "ДоговорКредитаИЗайма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДоговорКредитаИЗайма"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеРасходы" 

	Дано Я открываю основную форму списка документа "ДополнительныеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДополнительныеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ДополнительныеРасходы"

	Дано Я открываю основную форму документа "ДополнительныеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ДополнительныеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаданиеНаРаботу" 

	Дано Я открываю основную форму списка документа "ЗаданиеНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеНаРаботу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаданиеНаРаботу"

	Дано Я открываю основную форму документа "ЗаданиеНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаданиеНаРаботу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказМП" 

	Дано Я открываю основную форму списка документа "ЗаказМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказМП"

	Дано Я открываю основную форму документа "ЗаказМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказНаПроизводство" 

	Дано Я открываю основную форму списка документа "ЗаказНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПроизводство"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказНаПроизводство"

	Дано Я открываю основную форму документа "ЗаказНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказНаПроизводство"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПокупателя" 

	Дано Я открываю основную форму списка документа "ЗаказПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПокупателя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПокупателя"

	Дано Я открываю основную форму документа "ЗаказПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПокупателя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаказПоставщику" 

	Дано Я открываю основную форму списка документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаказПоставщику"

	Дано Я открываю основную форму документа "ЗаказПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаказПоставщику"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакрытиеМесяца" 

	Дано Я открываю основную форму списка документа "ЗакрытиеМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеМесяца"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗакрытиеМесяца"

	Дано Я открываю основную форму документа "ЗакрытиеМесяца"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗакрытиеМесяца"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиПатент" 

	Дано Я открываю основную форму списка документа "ЗаписиПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписиПатент"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиПатент"

	Дано Я открываю основную форму документа "ЗаписиПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписиПатент"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаписиУСН" 

	Дано Я открываю основную форму списка документа "ЗаписиУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписиУСН"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаписиУСН"

	Дано Я открываю основную форму документа "ЗаписиУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаписиУСН"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросАкцизныхМарокЕГАИС" 

	Дано Я открываю основную форму списка документа "ЗапросАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросАкцизныхМарокЕГАИС"

	Дано Я открываю основную форму документа "ЗапросАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка документа "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму документа "ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика" 

	Дано Я открываю основную форму списка документа "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"

	Дано Я открываю основную форму документа "ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросНаИнформационноеОбслуживаниеСтрахователя" 

	Дано Я открываю основную форму списка документа "ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросНаИнформационноеОбслуживаниеСтрахователя"

	Дано Я открываю основную форму документа "ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросНаИнформационноеОбслуживаниеСтрахователя"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапросСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка документа "ЗапросСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗапросСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму документа "ЗапросСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапросСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявкаНаВыпускКиЗГИСМ" 

	Дано Я открываю основную форму списка документа "ЗаявкаНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявкаНаВыпускКиЗГИСМ"

	Дано Я открываю основную форму документа "ЗаявкаНаВыпускКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявкаНаВыпускКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗаявлениеАбонентаСпецоператораСвязи" 

	Дано Я открываю основную форму списка документа "ЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЗаявлениеАбонентаСпецоператораСвязи"

	Дано Я открываю основную форму документа "ЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИзменениеПараметровВА" 

	Дано Я открываю основную форму списка документа "ИзменениеПараметровВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровВА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИзменениеПараметровВА"

	Дано Я открываю основную форму документа "ИзменениеПараметровВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИзменениеПараметровВА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияЗапасов" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияЗапасов"

	Дано Я открываю основную форму документа "ИнвентаризацияЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИнвентаризацияПродукцииВЕТИС" 

	Дано Я открываю основную форму списка документа "ИнвентаризацияПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияПродукцииВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИнвентаризацияПродукцииВЕТИС"

	Дано Я открываю основную форму документа "ИнвентаризацияПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИнвентаризацияПродукцииВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИсходящаяТранспортнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ИсходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ИсходящаяТранспортнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ИсходящаяТранспортнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ИсходящаяТранспортнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КадровоеПеремещение" 

	Дано Я открываю основную форму списка документа "КадровоеПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровоеПеремещение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КадровоеПеремещение"

	Дано Я открываю основную форму документа "КадровоеПеремещение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КадровоеПеремещение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КассоваяСмена" 

	Дано Я открываю основную форму списка документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КассоваяСмена"

	Дано Я открываю основную форму документа "КассоваяСмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КассоваяСмена"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаПоступления" 

	Дано Я открываю основную форму списка документа "КорректировкаПоступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПоступления"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаПоступления"

	Дано Я открываю основную форму документа "КорректировкаПоступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаПоступления"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРеализации" 

	Дано Я открываю основную форму списка документа "КорректировкаРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРеализации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРеализации"

	Дано Я открываю основную форму документа "КорректировкаРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРеализации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КорректировкаРегистров" 

	Дано Я открываю основную форму списка документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "КорректировкаРегистров"

	Дано Я открываю основную форму документа "КорректировкаРегистров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа КорректировкаРегистров"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаркировкаТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "МаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаркировкаТоваровГИСМ"

	Дано Я открываю основную форму документа "МаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МаршрутныйЛист" 

	Дано Я открываю основную форму списка документа "МаршрутныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаршрутныйЛист"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МаршрутныйЛист"

	Дано Я открываю основную форму документа "МаршрутныйЛист"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МаршрутныйЛист"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "МассоваяРассылка" 

	Дано Я открываю основную форму списка документа "МассоваяРассылка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МассоваяРассылка"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "МассоваяРассылка"

	Дано Я открываю основную форму документа "МассоваяРассылка"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа МассоваяРассылка"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеЗарплаты" 

	Дано Я открываю основную форму списка документа "НачислениеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗарплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеЗарплаты"

	Дано Я открываю основную форму документа "НачислениеЗарплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеЗарплаты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеНалогов" 

	Дано Я открываю основную форму списка документа "НачислениеНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеНалогов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеНалогов"

	Дано Я открываю основную форму документа "НачислениеНалогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеНалогов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачислениеСписаниеБонусныхБаллов" 

	Дано Я открываю основную форму списка документа "НачислениеСписаниеБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеБонусныхБаллов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачислениеСписаниеБонусныхБаллов"

	Дано Я открываю основную форму документа "НачислениеСписаниеБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачислениеСписаниеБонусныхБаллов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НачисленияПоКредитамИЗаймам" 

	Дано Я открываю основную форму списка документа "НачисленияПоКредитамИЗаймам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачисленияПоКредитамИЗаймам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "НачисленияПоКредитамИЗаймам"

	Дано Я открываю основную форму документа "НачисленияПоКредитамИЗаймам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НачисленияПоКредитамИЗаймам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС" 

	Дано Я открываю основную форму списка документа "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"

	Дано Я открываю основную форму документа "ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОбъединениеЗаписейСкладскогоЖурналаВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Операция" 

	Дано Я открываю основную форму списка документа "Операция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Операция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Операция"

	Дано Я открываю основную форму документа "Операция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Операция"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОперацияПоПлатежнымКартам" 

	Дано Я открываю основную форму списка документа "ОперацияПоПлатежнымКартам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоПлатежнымКартам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОперацияПоПлатежнымКартам"

	Дано Я открываю основную форму документа "ОперацияПоПлатежнымКартам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОперацияПоПлатежнымКартам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьОДВ_1" 

	Дано Я открываю основную форму списка документа "ОписьОДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьОДВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьОДВ_1"

	Дано Я открываю основную форму документа "ОписьОДВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьОДВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОписьПачекСЗВ_6" 

	Дано Я открываю основную форму списка документа "ОписьПачекСЗВ_6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьПачекСЗВ_6"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОписьПачекСЗВ_6"

	Дано Я открываю основную форму документа "ОписьПачекСЗВ_6"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОписьПачекСЗВ_6"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОприходованиеЗапасов" 

	Дано Я открываю основную форму списка документа "ОприходованиеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОприходованиеЗапасов"

	Дано Я открываю основную форму документа "ОприходованиеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОприходованиеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОстаткиЕГАИС" 

	Дано Я открываю основную форму списка документа "ОстаткиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОстаткиЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОстаткиЕГАИС"

	Дано Я открываю основную форму документа "ОстаткиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОстаткиЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетЕГАИС" 

	Дано Я открываю основную форму списка документа "ОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетЕГАИС"

	Дано Я открываю основную форму документа "ОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомиссионера" 

	Дано Я открываю основную форму списка документа "ОтчетКомиссионера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионера"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомиссионера"

	Дано Я открываю основную форму документа "ОтчетКомиссионера"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомиссионера"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетКомитенту" 

	Дано Я открываю основную форму списка документа "ОтчетКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитенту"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетКомитенту"

	Дано Я открываю основную форму документа "ОтчетКомитенту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетКомитенту"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОПереработке" 

	Дано Я открываю основную форму списка документа "ОтчетОПереработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОПереработке"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОПереработке"

	Дано Я открываю основную форму документа "ОтчетОПереработке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОПереработке"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОРозничныхПродажах" 

	Дано Я открываю основную форму списка документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОРозничныхПродажах"

	Дано Я открываю основную форму документа "ОтчетОРозничныхПродажах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажах"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетОРозничныхПродажахМП" 

	Дано Я открываю основную форму списка документа "ОтчетОРозничныхПродажахМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажахМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетОРозничныхПродажахМП"

	Дано Я открываю основную форму документа "ОтчетОРозничныхПродажахМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетОРозничныхПродажахМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОтчетПереработчика" 

	Дано Я открываю основную форму списка документа "ОтчетПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПереработчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ОтчетПереработчика"

	Дано Я открываю основную форму документа "ОтчетПереработчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтчетПереработчика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетОбменСБанками"

	Дано Я открываю основную форму документа "ПакетОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПакетЭД" 

	Дано Я открываю основную форму списка документа "ПакетЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПакетЭД"

	Дано Я открываю основную форму документа "ПакетЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПакетЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_3" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_3"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_3"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаДокументовСЗВ_6_4" 

	Дано Я открываю основную форму списка документа "ПачкаДокументовСЗВ_6_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_4"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаДокументовСЗВ_6_4"

	Дано Я открываю основную форму документа "ПачкаДокументовСЗВ_6_4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаДокументовСЗВ_6_4"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаРазделов6РасчетаРСВ_1" 

	Дано Я открываю основную форму списка документа "ПачкаРазделов6РасчетаРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделов6РасчетаРСВ_1"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаРазделов6РасчетаРСВ_1"

	Дано Я открываю основную форму документа "ПачкаРазделов6РасчетаРСВ_1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделов6РасчетаРСВ_1"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПачкаРазделовДекларацииПоНДСС8По12Разделы" 

	Дано Я открываю основную форму списка документа "ПачкаРазделовДекларацииПоНДСС8По12Разделы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделовДекларацииПоНДСС8По12Разделы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПачкаРазделовДекларацииПоНДСС8По12Разделы"

	Дано Я открываю основную форму документа "ПачкаРазделовДекларацииПоНДСС8По12Разделы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПачкаРазделовДекларацииПоНДСС8По12Разделы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаВА" 

	Дано Я открываю основную форму списка документа "ПередачаВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаВА"

	Дано Я открываю основную форму документа "ПередачаВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПередачаВРегистр2ЕГАИС" 

	Дано Я открываю основную форму списка документа "ПередачаВРегистр2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРегистр2ЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПередачаВРегистр2ЕГАИС"

	Дано Я открываю основную форму документа "ПередачаВРегистр2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПередачаВРегистр2ЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремаркировкаТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "ПеремаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремаркировкаТоваровГИСМ"

	Дано Я открываю основную форму документа "ПеремаркировкаТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремаркировкаТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеДС" 

	Дано Я открываю основную форму списка документа "ПеремещениеДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеДС"

	Дано Я открываю основную форму документа "ПеремещениеДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеДСПлан" 

	Дано Я открываю основную форму списка документа "ПеремещениеДСПлан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеДСПлан"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеДСПлан"

	Дано Я открываю основную форму документа "ПеремещениеДСПлан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеДСПлан"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеЗапасов" 

	Дано Я открываю основную форму списка документа "ПеремещениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеЗапасов"

	Дано Я открываю основную форму документа "ПеремещениеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПеремещениеПоЯчейкам" 

	Дано Я открываю основную форму списка документа "ПеремещениеПоЯчейкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеПоЯчейкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПеремещениеПоЯчейкам"

	Дано Я открываю основную форму документа "ПеремещениеПоЯчейкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПеремещениеПоЯчейкам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПереоценкаВРозницеСуммовойУчет" 

	Дано Я открываю основную форму списка документа "ПереоценкаВРозницеСуммовойУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаВРозницеСуммовойУчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПереоценкаВРозницеСуммовойУчет"

	Дано Я открываю основную форму документа "ПереоценкаВРозницеСуммовойУчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПереоценкаВРозницеСуммовойУчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПересортицаЗапасов" 

	Дано Я открываю основную форму списка документа "ПересортицаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересортицаЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПересортицаЗапасов"

	Дано Я открываю основную форму документа "ПересортицаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПересортицаЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПисьмоОбменСБанками" 

	Дано Я открываю основную форму списка документа "ПисьмоОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПисьмоОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПисьмоОбменСБанками"

	Дано Я открываю основную форму документа "ПисьмоОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПисьмоОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПланПродаж" 

	Дано Я открываю основную форму списка документа "ПланПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПланПродаж"

	Дано Я открываю основную форму документа "ПланПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПланПродаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежнаяВедомость" 

	Дано Я открываю основную форму списка документа "ПлатежнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежнаяВедомость"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежнаяВедомость"

	Дано Я открываю основную форму документа "ПлатежнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежнаяВедомость"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПлатежноеПоручение" 

	Дано Я открываю основную форму списка документа "ПлатежноеПоручение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежноеПоручение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПлатежноеПоручение"

	Дано Я открываю основную форму документа "ПлатежноеПоручение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПлатежноеПоручение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоказателиЕНВД" 

	Дано Я открываю основную форму списка документа "ПоказателиЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоказателиЕНВД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоказателиЕНВД"

	Дано Я открываю основную форму документа "ПоказателиЕНВД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоказателиЕНВД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеВКассу" 

	Дано Я открываю основную форму списка документа "ПоступлениеВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеВКассу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеВКассу"

	Дано Я открываю основную форму документа "ПоступлениеВКассу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеВКассу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеДСПлан" 

	Дано Я открываю основную форму списка документа "ПоступлениеДСПлан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеДСПлан"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеДСПлан"

	Дано Я открываю основную форму документа "ПоступлениеДСПлан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеДСПлан"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоступлениеНаСчет" 

	Дано Я открываю основную форму списка документа "ПоступлениеНаСчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеНаСчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоступлениеНаСчет"

	Дано Я открываю основную форму документа "ПоступлениеНаСчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоступлениеНаСчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоясненияКДекларацииПоНДС" 

	Дано Я открываю основную форму списка документа "ПоясненияКДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоясненияКДекларацииПоНДС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПоясненияКДекларацииПоНДС"

	Дано Я открываю основную форму документа "ПоясненияКДекларацииПоНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПоясненияКДекларацииПоНДС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемИПередачаВРемонт" 

	Дано Я открываю основную форму списка документа "ПриемИПередачаВРемонт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемИПередачаВРемонт"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемИПередачаВРемонт"

	Дано Я открываю основную форму документа "ПриемИПередачаВРемонт"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемИПередачаВРемонт"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриемНаРаботу" 

	Дано Я открываю основную форму списка документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриемНаРаботу"

	Дано Я открываю основную форму документа "ПриемНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриемНаРаботу"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПринятиеКУчетуВА" 

	Дано Я открываю основную форму списка документа "ПринятиеКУчетуВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуВА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПринятиеКУчетуВА"

	Дано Я открываю основную форму документа "ПринятиеКУчетуВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПринятиеКУчетуВА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходДенегМП" 

	Дано Я открываю основную форму списка документа "ПриходДенегМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходДенегМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходДенегМП"

	Дано Я открываю основную форму документа "ПриходДенегМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходДенегМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходнаяНакладная" 

	Дано Я открываю основную форму списка документа "ПриходнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходнаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходнаяНакладная"

	Дано Я открываю основную форму документа "ПриходнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходнаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходныйОрдер" 

	Дано Я открываю основную форму списка документа "ПриходныйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходныйОрдер"

	Дано Я открываю основную форму документа "ПриходныйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходныйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПриходТовараМП" 

	Дано Я открываю основную форму списка документа "ПриходТовараМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходТовараМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПриходТовараМП"

	Дано Я открываю основную форму документа "ПриходТовараМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПриходТовараМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственнаяОперацияВЕТИС" 

	Дано Я открываю основную форму списка документа "ПроизводственнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперацияВЕТИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводственнаяОперацияВЕТИС"

	Дано Я открываю основную форму документа "ПроизводственнаяОперацияВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводственнаяОперацияВЕТИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводствоМП" 

	Дано Я открываю основную форму списка документа "ПроизводствоМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводствоМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПроизводствоМП"

	Дано Я открываю основную форму документа "ПроизводствоМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПроизводствоМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрочиеРасходы" 

	Дано Я открываю основную форму списка документа "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеРасходы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ПрочиеРасходы"

	Дано Я открываю основную форму документа "ПрочиеРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ПрочиеРасходы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РаспределениеЗатрат" 

	Дано Я открываю основную форму списка документа "РаспределениеЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеЗатрат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РаспределениеЗатрат"

	Дано Я открываю основную форму документа "РаспределениеЗатрат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РаспределениеЗатрат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходДенегМП" 

	Дано Я открываю основную форму списка документа "РасходДенегМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходДенегМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходДенегМП"

	Дано Я открываю основную форму документа "РасходДенегМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходДенегМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходДСПлан" 

	Дано Я открываю основную форму списка документа "РасходДСПлан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходДСПлан"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходДСПлан"

	Дано Я открываю основную форму документа "РасходДСПлан"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходДСПлан"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходИзКассы" 

	Дано Я открываю основную форму списка документа "РасходИзКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходИзКассы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходИзКассы"

	Дано Я открываю основную форму документа "РасходИзКассы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходИзКассы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходнаяНакладная" 

	Дано Я открываю основную форму списка документа "РасходнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходнаяНакладная"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходнаяНакладная"

	Дано Я открываю основную форму документа "РасходнаяНакладная"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходнаяНакладная"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходныйОрдер" 

	Дано Я открываю основную форму списка документа "РасходныйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйОрдер"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходныйОрдер"

	Дано Я открываю основную форму документа "РасходныйОрдер"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходныйОрдер"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходСоСчета" 

	Дано Я открываю основную форму списка документа "РасходСоСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходСоСчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходСоСчета"

	Дано Я открываю основную форму документа "РасходСоСчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходСоСчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходТовараМП" 

	Дано Я открываю основную форму списка документа "РасходТовараМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходТовараМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходТовараМП"

	Дано Я открываю основную форму документа "РасходТовараМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходТовараМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РасходыПриИмпорте" 

	Дано Я открываю основную форму списка документа "РасходыПриИмпорте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходыПриИмпорте"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РасходыПриИмпорте"

	Дано Я открываю основную форму документа "РасходыПриИмпорте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РасходыПриИмпорте"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РегламентированныйОтчет" 

	Дано Я открываю основную форму списка документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РегламентированныйОтчет"

	Дано Я открываю основную форму документа "РегламентированныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РегламентированныйОтчет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РеестрСЗВ_6_2" 

	Дано Я открываю основную форму списка документа "РеестрСЗВ_6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСЗВ_6_2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РеестрСЗВ_6_2"

	Дано Я открываю основную форму документа "РеестрСЗВ_6_2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РеестрСЗВ_6_2"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РезервированиеЗапасов" 

	Дано Я открываю основную форму списка документа "РезервированиеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РезервированиеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "РезервированиеЗапасов"

	Дано Я открываю основную форму документа "РезервированиеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа РезервированиеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СборкаЗапасов" 

	Дано Я открываю основную форму списка документа "СборкаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СборкаЗапасов"

	Дано Я открываю основную форму документа "СборкаЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СборкаЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОЗастрахованныхЛицахСЗВ_М" 

	Дано Я открываю основную форму списка документа "СведенияОЗастрахованныхЛицахСЗВ_М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованныхЛицахСЗВ_М"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОЗастрахованныхЛицахСЗВ_М"

	Дано Я открываю основную форму документа "СведенияОЗастрахованныхЛицахСЗВ_М"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОЗастрахованныхЛицахСЗВ_М"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ" 

	Дано Я открываю основную форму списка документа "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"

	Дано Я открываю основную форму документа "СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СверкаВзаиморасчетов" 

	Дано Я открываю основную форму списка документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СверкаВзаиморасчетов"

	Дано Я открываю основную форму документа "СверкаВзаиморасчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СверкаВзаиморасчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СдельныйНаряд" 

	Дано Я открываю основную форму списка документа "СдельныйНаряд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СдельныйНаряд"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СдельныйНаряд"

	Дано Я открываю основную форму документа "СдельныйНаряд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СдельныйНаряд"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Событие" 

	Дано Я открываю основную форму списка документа "Событие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Событие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Событие"

	Дано Я открываю основную форму документа "Событие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Событие"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеОбменСБанками" 

	Дано Я открываю основную форму списка документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СообщениеОбменСБанками"

	Дано Я открываю основную форму документа "СообщениеОбменСБанками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеОбменСБанками"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеВА" 

	Дано Я открываю основную форму списка документа "СписаниеВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеВА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеВА"

	Дано Я открываю основную форму документа "СписаниеВА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеВА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеЗапасов" 

	Дано Я открываю основную форму списка документа "СписаниеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗапасов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеЗапасов"

	Дано Я открываю основную форму документа "СписаниеЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеЗапасов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СписаниеПроданныхПодарочныхСертификатов" 

	Дано Я открываю основную форму списка документа "СписаниеПроданныхПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеПроданныхПодарочныхСертификатов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СписаниеПроданныхПодарочныхСертификатов"

	Дано Я открываю основную форму документа "СписаниеПроданныхПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СписаниеПроданныхПодарочныхСертификатов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкаНДФЛ" 

	Дано Я открываю основную форму списка документа "СправкаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаНДФЛ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкаНДФЛ"

	Дано Я открываю основную форму документа "СправкаНДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкаНДФЛ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиНДФЛДляПередачиВНалоговыйОрган" 

	Дано Я открываю основную форму списка документа "СправкиНДФЛДляПередачиВНалоговыйОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиНДФЛДляПередачиВНалоговыйОрган"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиНДФЛДляПередачиВНалоговыйОрган"

	Дано Я открываю основную форму документа "СправкиНДФЛДляПередачиВНалоговыйОрган"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиНДФЛДляПередачиВНалоговыйОрган"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СправкиСПАРКРиски" 

	Дано Я открываю основную форму списка документа "СправкиСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиСПАРКРиски"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СправкиСПАРКРиски"

	Дано Я открываю основную форму документа "СправкиСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СправкиСПАРКРиски"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетНаОплату" 

	Дано Я открываю основную форму списка документа "СчетНаОплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплату"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетНаОплату"

	Дано Я открываю основную форму документа "СчетНаОплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплату"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетНаОплатуПоставщика" 

	Дано Я открываю основную форму списка документа "СчетНаОплатуПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплатуПоставщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетНаОплатуПоставщика"

	Дано Я открываю основную форму документа "СчетНаОплатуПоставщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетНаОплатуПоставщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактура" 

	Дано Я открываю основную форму списка документа "СчетФактура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактура"

	Дано Я открываю основную форму документа "СчетФактура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СчетФактураПолученный" 

	Дано Я открываю основную форму списка документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "СчетФактураПолученный"

	Дано Я открываю основную форму документа "СчетФактураПолученный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СчетФактураПолученный"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Табель" 

	Дано Я открываю основную форму списка документа "Табель"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Табель"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Табель"

	Дано Я открываю основную форму документа "Табель"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Табель"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТранспортноеСообщение" 

	Дано Я открываю основную форму списка документа "ТранспортноеСообщение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортноеСообщение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТранспортноеСообщение"

	Дано Я открываю основную форму документа "ТранспортноеСообщение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТранспортноеСообщение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТТНВходящаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТТНВходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНВходящаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТТНВходящаяЕГАИС"

	Дано Я открываю основную форму документа "ТТНВходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНВходящаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТТНИсходящаяЕГАИС" 

	Дано Я открываю основную форму списка документа "ТТНИсходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНИсходящаяЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ТТНИсходящаяЕГАИС"

	Дано Я открываю основную форму документа "ТТНИсходящаяЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТТНИсходящаяЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбИмпортеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбИмпортеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПолучателеДокументов" 

	Дано Я открываю основную форму списка документа "УведомлениеОПолучателеДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПолучателеДокументов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПолучателеДокументов"

	Дано Я открываю основную форму документа "УведомлениеОПолучателеДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПолучателеДокументов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОПоступленииМаркированныхТоваровГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОПоступленииМаркированныхТоваровГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОПоступленииМаркированныхТоваровГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСпецрежимахНалогообложения" 

	Дано Я открываю основную форму списка документа "УведомлениеОСпецрежимахНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСпецрежимахНалогообложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСпецрежимахНалогообложения"

	Дано Я открываю основную форму документа "УведомлениеОСпецрежимахНалогообложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСпецрежимахНалогообложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УведомлениеОСписанииКиЗГИСМ" 

	Дано Я открываю основную форму списка документа "УведомлениеОСписанииКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСписанииКиЗГИСМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УведомлениеОСписанииКиЗГИСМ"

	Дано Я открываю основную форму документа "УведомлениеОСписанииКиЗГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УведомлениеОСписанииКиЗГИСМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Увольнение" 

	Дано Я открываю основную форму списка документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "Увольнение"

	Дано Я открываю основную форму документа "Увольнение"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Увольнение"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП" 

	Дано Я открываю основную форму списка документа "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"

	Дано Я открываю основную форму документа "УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика" 

	Дано Я открываю основную форму списка документа "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"

	Дано Я открываю основную форму документа "УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьЗаявлениеАбонентаСпецоператораСвязи" 

	Дано Я открываю основную форму списка документа "УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьЗаявлениеАбонентаСпецоператораСвязи"

	Дано Я открываю основную форму документа "УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьЗаявлениеАбонентаСпецоператораСвязи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьКассовыйЧекКоррекции" 

	Дано Я открываю основную форму списка документа "УдалитьКассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассовыйЧекКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьКассовыйЧекКоррекции"

	Дано Я открываю основную форму документа "УдалитьКассовыйЧекКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьКассовыйЧекКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УдалитьПроизвольныйЭД" 

	Дано Я открываю основную форму списка документа "УдалитьПроизвольныйЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьПроизвольныйЭД"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УдалитьПроизвольныйЭД"

	Дано Я открываю основную форму документа "УдалитьПроизвольныйЭД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УдалитьПроизвольныйЭД"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетВремени" 

	Дано Я открываю основную форму списка документа "УчетВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УчетВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "УчетВремени"

	Дано Я открываю основную форму документа "УчетВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа УчетВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекЕГАИС" 

	Дано Я открываю основную форму списка документа "ЧекЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекЕГАИС"

	Дано Я открываю основную форму документа "ЧекЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекЕГАИСВозврат" 

	Дано Я открываю основную форму списка документа "ЧекЕГАИСВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИСВозврат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекЕГАИСВозврат"

	Дано Я открываю основную форму документа "ЧекЕГАИСВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекЕГАИСВозврат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМ" 

	Дано Я открываю основную форму списка документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМ"

	Дано Я открываю основную форму документа "ЧекККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМВозврат" 

	Дано Я открываю основную форму списка документа "ЧекККМВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозврат"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМВозврат"

	Дано Я открываю основную форму документа "ЧекККМВозврат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозврат"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМВозвратМП" 

	Дано Я открываю основную форму списка документа "ЧекККМВозвратМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозвратМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМВозвратМП"

	Дано Я открываю основную форму документа "ЧекККМВозвратМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМВозвратМП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККМКоррекции" 

	Дано Я открываю основную форму списка документа "ЧекККМКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМКоррекции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККМКоррекции"

	Дано Я открываю основную форму документа "ЧекККМКоррекции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККМКоррекции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЧекККММП" 

	Дано Я открываю основную форму списка документа "ЧекККММП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККММП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЧекККММП"

	Дано Я открываю основную форму документа "ЧекККММП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЧекККММП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныйДокументВходящий" 

	Дано Я открываю основную форму списка документа "ЭлектронныйДокументВходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументВходящий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныйДокументВходящий"

	Дано Я открываю основную форму документа "ЭлектронныйДокументВходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументВходящий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронныйДокументИсходящий" 

	Дано Я открываю основную форму списка документа "ЭлектронныйДокументИсходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументИсходящий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объекта "ЭлектронныйДокументИсходящий"

	Дано Я открываю основную форму документа "ЭлектронныйДокументИсходящий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронныйДокументИсходящий"
	И Я закрываю текущее окно

