
#language: ru

@tree
@SmokeTest
Функциональность: Дымовые тесты по отчетам и обработкам

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Открытие формы объекта "ABCXYZАнализПродаж"

	Дано Я открываю основную форму отчета "ABCXYZАнализПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ABCXYZАнализПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ABCАнализПродаж"

	Дано Я открываю основную форму отчета "ABCАнализПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ABCАнализПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АвтоматическиеСкидки"

	Дано Я открываю основную форму отчета "АвтоматическиеСкидки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АвтоматическиеСкидки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АктСверки"

	Дано Я открываю основную форму отчета "АктСверки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АктСверки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализБазыКонтрагентов"

	Дано Я открываю основную форму отчета "АнализБазыКонтрагентов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализБазыКонтрагентов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализБазыЛидов"

	Дано Я открываю основную форму отчета "АнализБазыЛидов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализБазыЛидов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализБизнеса"

	Дано Я открываю основную форму отчета "АнализБизнеса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализБизнеса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализДоступности"

	Дано Я открываю основную форму отчета "АнализДоступности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализДоступности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗаказаПокупателя"

	Дано Я открываю основную форму отчета "АнализЗаказаПокупателя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗаказаПокупателя"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗаказаПоставщику"

	Дано Я открываю основную форму отчета "АнализЗаказаПоставщику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗаказаПоставщику"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализЗаказовПокупателей"

	Дано Я открываю основную форму отчета "АнализЗаказовПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЗаказовПокупателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализНачисленийБонусныхБаллов"

	Дано Я открываю основную форму отчета "АнализНачисленийБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализНачисленийБонусныхБаллов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОплатыПоЗаказамПокупателей"

	Дано Я открываю основную форму отчета "АнализОплатыПоЗаказамПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОплатыПоЗаказамПокупателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализОплатыПоЗаказамПоставщикам"

	Дано Я открываю основную форму отчета "АнализОплатыПоЗаказамПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОплатыПоЗаказамПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализПотребности"

	Дано Я открываю основную форму отчета "АнализПотребности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализПотребности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРаботыМенеджеров"

	Дано Я открываю основную форму отчета "АнализРаботыМенеджеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРаботыМенеджеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПоступленииКиЗ"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПоступленииКиЗ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПоступленииКиЗ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализРасхожденийПриПоступленииПродукцииВЕТИС"

	Дано Я открываю основную форму отчета "АнализРасхожденийПриПоступленииПродукцииВЕТИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализРасхожденийПриПоступленииПродукцииВЕТИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСчетовИЗаказовВВалютеУчета"

	Дано Я открываю основную форму отчета "АнализСчетовИЗаказовВВалютеУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСчетовИЗаказовВВалютеУчета"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСчетовНаОплату"

	Дано Я открываю основную форму отчета "АнализСчетовНаОплату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСчетовНаОплату"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "АнализСчетовНаОплатуПоставщиков"

	Дано Я открываю основную форму отчета "АнализСчетовНаОплатуПоставщиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализСчетовНаОплатуПоставщиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Баланс"

	Дано Я открываю основную форму отчета "Баланс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Баланс"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БюджетДвиженияДенежныхСредств"

	Дано Я открываю основную форму отчета "БюджетДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БюджетДвиженияДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "БюджетПрибылейИУбытков"

	Дано Я открываю основную форму отчета "БюджетПрибылейИУбытков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БюджетПрибылейИУбытков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"

	Дано Я открываю основную форму отчета "ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВедомостьПоТоварамНаСкладахВЦенахНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Взаиморасчеты"

	Дано Я открываю основную форму отчета "Взаиморасчеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Взаиморасчеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВзаиморасчетыКратко"

	Дано Я открываю основную форму отчета "ВзаиморасчетыКратко"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВзаиморасчетыКратко"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВнеоборотныеАктивы"

	Дано Я открываю основную форму отчета "ВнеоборотныеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВнеоборотныеАктивы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоронкаПоЛидам"

	Дано Я открываю основную форму отчета "ВоронкаПоЛидам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоронкаПоЛидам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВоронкаПродаж"

	Дано Я открываю основную форму отчета "ВоронкаПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВоронкаПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыполнениеДоговоровОбслуживания"

	Дано Я открываю основную форму отчета "ВыполнениеДоговоровОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыполнениеДоговоровОбслуживания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыпускПродукции"

	Дано Я открываю основную форму отчета "ВыпускПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыпускПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ВыработкаВнеоборотныхАктивов"

	Дано Я открываю основную форму отчета "ВыработкаВнеоборотныхАктивов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ВыработкаВнеоборотныхАктивов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ГрафикДвиженияЗапасов"

	Дано Я открываю основную форму отчета "ГрафикДвиженияЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ГрафикДвиженияЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвижениеДенежныхСредств"

	Дано Я открываю основную форму отчета "ДвижениеДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвижениеДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвижениеПодарочныхСертификатов"

	Дано Я открываю основную форму отчета "ДвижениеПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвижениеПодарочныхСертификатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвижениеТоваров"

	Дано Я открываю основную форму отчета "ДвижениеТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвижениеТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияБонусныхБаллов"

	Дано Я открываю основную форму отчета "ДвиженияБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияБонусныхБаллов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияМеждуРегистрамиЕГАИС"

	Дано Я открываю основную форму отчета "ДвиженияМеждуРегистрамиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияМеждуРегистрамиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияПоСправке2ЕГАИС"

	Дано Я открываю основную форму отчета "ДвиженияПоСправке2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияПоСправке2ЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДвиженияСерийныхНомеров"

	Дано Я открываю основную форму отчета "ДвиженияСерийныхНомеров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияСерийныхНомеров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДенежныеСредства"

	Дано Я открываю основную форму отчета "ДенежныеСредства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДенежныеСредства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДенежныеСредстваВКассахККМ"

	Дано Я открываю основную форму отчета "ДенежныеСредстваВКассахККМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДенежныеСредстваВКассахККМ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДенежныеСредстваКПоступлению"

	Дано Я открываю основную форму отчета "ДенежныеСредстваКПоступлению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДенежныеСредстваКПоступлению"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДенежныеСредстваПрогноз"

	Дано Я открываю основную форму отчета "ДенежныеСредстваПрогноз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДенежныеСредстваПрогноз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДенежныйПоток"

	Дано Я открываю основную форму отчета "ДенежныйПоток"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДенежныйПоток"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДиаграммаСостоянияЭДО"

	Дано Я открываю основную форму отчета "ДиаграммаСостоянияЭДО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДиаграммаСостоянияЭДО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаЗадолженностиПокупателей"

	Дано Я открываю основную форму отчета "ДинамикаЗадолженностиПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаЗадолженностиПокупателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДинамикаЗадолженностиПоставщикам"

	Дано Я открываю основную форму отчета "ДинамикаЗадолженностиПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДинамикаЗадолженностиПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Долги"

	Дано Я открываю основную форму отчета "Долги"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Долги"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДосьеКонтрагента"

	Дано Я открываю основную форму отчета "ДосьеКонтрагента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДосьеКонтрагента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоходыИРасходы"

	Дано Я открываю основную форму отчета "ДоходыИРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДоходыИРасходы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоходыИРасходыКассовымМетодом"

	Дано Я открываю основную форму отчета "ДоходыИРасходыКассовымМетодом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДоходыИРасходыКассовымМетодом"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоходыИРасходыПрогноз"

	Дано Я открываю основную форму отчета "ДоходыИРасходыПрогноз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДоходыИРасходыПрогноз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ДоходыРасходы"

	Дано Я открываю основную форму отчета "ДоходыРасходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДоходыРасходы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаВыданныхПокупателюДокументов"

	Дано Я открываю основную форму отчета "ЖурналУчетаВыданныхПокупателюДокументов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаВыданныхПокупателюДокументов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЖурналУчетаПродажиАлкогольнойПродукции"

	Дано Я открываю основную форму отчета "ЖурналУчетаПродажиАлкогольнойПродукции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЖурналУчетаПродажиАлкогольнойПродукции"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаданияНаРаботу"

	Дано Я открываю основную форму отчета "ЗаданияНаРаботу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаданияНаРаботу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаказыНаПроизводство"

	Дано Я открываю основную форму отчета "ЗаказыНаПроизводство"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаказыНаПроизводство"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаказыПокупателей"

	Дано Я открываю основную форму отчета "ЗаказыПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаказыПокупателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗаказыПоставщикам"

	Дано Я открываю основную форму отчета "ЗаказыПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗаказыПоставщикам"
	И Я закрываю текущее окно





Сценарий: Открытие формы объекта "Закупки"

	Дано Я открываю основную форму отчета "Закупки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Закупки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Запасы"

	Дано Я открываю основную форму отчета "Запасы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Запасы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗапасыВРазрезеГТД"

	Дано Я открываю основную форму отчета "ЗапасыВРазрезеГТД"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗапасыВРазрезеГТД"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗапасыПереданные"

	Дано Я открываю основную форму отчета "ЗапасыПереданные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗапасыПереданные"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЗапасыПринятые"

	Дано Я открываю основную форму отчета "ЗапасыПринятые"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗапасыПринятые"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИзлишкиИНедостачи"

	Дано Я открываю основную форму отчета "ИзлишкиИНедостачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИзлишкиИНедостачи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИндексыСПАРКРиски"

	Дано Я открываю основную форму отчета "ИндексыСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИндексыСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИнформацияОбОрганизацииЕГАИС"

	Дано Я открываю основную форму отчета "ИнформацияОбОрганизацииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИнформацияОбОрганизацииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ИсторияСправок2ЕГАИС"

	Дано Я открываю основную форму отчета "ИсторияСправок2ЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИсторияСправок2ЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КалендарьСобытий"

	Дано Я открываю основную форму отчета "КалендарьСобытий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КалендарьСобытий"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаУчетаДоходовИРасходов"

	Дано Я открываю основную форму отчета "КнигаУчетаДоходовИРасходов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаУчетаДоходовИРасходов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КнигаУчетаДоходовПатент"

	Дано Я открываю основную форму отчета "КнигаУчетаДоходовПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КнигаУчетаДоходовПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольЗаполненияКонтактнойИнформации"

	Дано Я открываю основную форму отчета "КонтрольЗаполненияКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольЗаполненияКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "КонтрольОперацийЭквайринга"

	Дано Я открываю основную форму отчета "КонтрольОперацийЭквайринга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета КонтрольОперацийЭквайринга"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НачисленияИУдержания"

	Дано Я открываю основную форму отчета "НачисленияИУдержания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НачисленияИУдержания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НеобработанныеТТНЕГАИС"

	Дано Я открываю основную форму отчета "НеобработанныеТТНЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НеобработанныеТТНЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НЗП"

	Дано Я открываю основную форму отчета "НЗП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НЗП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "НормативныйСоставИзделия"

	Дано Я открываю основную форму отчета "НормативныйСоставИзделия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета НормативныйСоставИзделия"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборачиваемостьЗапасов"

	Дано Я открываю основную форму отчета "ОборачиваемостьЗапасов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборачиваемостьЗапасов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОборотноСальдоваяВедомость"

	Дано Я открываю основную форму отчета "ОборотноСальдоваяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОборотноСальдоваяВедомость"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбработанныеЧекиЕГАИС"

	Дано Я открываю основную форму отчета "ОбработанныеЧекиЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбработанныеЧекиЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОплатаПлатежнымиКартами"

	Дано Я открываю основную форму отчета "ОплатаПлатежнымиКартами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОплатаПлатежнымиКартами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиАкцизныхМарокЕГАИС"

	Дано Я открываю основную форму отчета "ОстаткиАкцизныхМарокЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиАкцизныхМарокЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиАлкогольнойПродукцииЕГАИС"

	Дано Я открываю основную форму отчета "ОстаткиАлкогольнойПродукцииЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиАлкогольнойПродукцииЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиБонусныхБаллов"

	Дано Я открываю основную форму отчета "ОстаткиБонусныхБаллов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиБонусныхБаллов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиНаборов"

	Дано Я открываю основную форму отчета "ОстаткиНаборов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиНаборов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиПодарочныхСертификатов"

	Дано Я открываю основную форму отчета "ОстаткиПодарочныхСертификатов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиПодарочныхСертификатов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваров"

	Дано Я открываю основную форму отчета "ОстаткиТоваров"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваров"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОстаткиТоваровМеньшеНуля"

	Дано Я открываю основную форму отчета "ОстаткиТоваровМеньшеНуля"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОстаткиТоваровМеньшеНуля"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ОтработанноеВремя"

	Дано Я открываю основную форму отчета "ОтработанноеВремя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтработанноеВремя"
	И Я закрываю текущее окно




Сценарий: Открытие формы объекта "ОценкаПроизводительности"

	Дано Я открываю основную форму отчета "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланируемыеОстаткиДС"

	Дано Я открываю основную форму отчета "ПланируемыеОстаткиДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланируемыеОстаткиДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлановыеДвиженияДенежныхСредств"

	Дано Я открываю основную форму отчета "ПлановыеДвиженияДенежныхСредств"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлановыеДвиженияДенежныхСредств"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализПродаж"

	Дано Я открываю основную форму отчета "ПланФактныйАнализПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализПроизводства"

	Дано Я открываю основную форму отчета "ПланФактныйАнализПроизводства"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализПроизводства"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланФактныйАнализСебестоимостиВыпуска"

	Дано Я открываю основную форму отчета "ПланФактныйАнализСебестоимостиВыпуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланФактныйАнализСебестоимостиВыпуска"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПланыПродаж"

	Дано Я открываю основную форму отчета "ПланыПродаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПланыПродаж"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПлатежныйКалендарь"

	Дано Я открываю основную форму отчета "ПлатежныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПлатежныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПоступленияБезДокументовГИСМ"

	Дано Я открываю основную форму отчета "ПоступленияБезДокументовГИСМ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПоступленияБезДокументовГИСМ"
	И Я закрываю текущее окно




Сценарий: Открытие формы объекта "ПрибылиИУбытки"

	Дано Я открываю основную форму отчета "ПрибылиИУбытки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрибылиИУбытки"
	И Я закрываю текущее окно






Сценарий: Открытие формы объекта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогнозныйБаланс"

	Дано Я открываю основную форму отчета "ПрогнозныйБаланс"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогнозныйБаланс"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Продажи"

	Дано Я открываю основную форму отчета "Продажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Продажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПродажиПоДисконтнымКартам"

	Дано Я открываю основную форму отчета "ПродажиПоДисконтнымКартам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПродажиПоДисконтнымКартам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ПубликуемыеТорговыеПредложения"

	Дано Я открываю основную форму отчета "ПубликуемыеТорговыеПредложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПубликуемыеТорговыеПредложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РазмещениеЗаказов"

	Дано Я открываю основную форму отчета "РазмещениеЗаказов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РазмещениеЗаказов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РаспределениеМатериалов"

	Дано Я открываю основную форму отчета "РаспределениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РаспределениеМатериалов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Расходы"

	Дано Я открываю основную форму отчета "Расходы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Расходы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетнаяВедомость"

	Дано Я открываю основную форму отчета "РасчетнаяВедомость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетнаяВедомость"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетныеЛистки"

	Дано Я открываю основную форму отчета "РасчетныеЛистки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетныеЛистки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыПоКредитамИЗаймам"

	Дано Я открываю основную форму отчета "РасчетыПоКредитамИЗаймам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыПоКредитамИЗаймам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыПоНалогам"

	Дано Я открываю основную форму отчета "РасчетыПоНалогам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыПоНалогам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыПоПрочимОперациям"

	Дано Я открываю основную форму отчета "РасчетыПоПрочимОперациям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыПоПрочимОперациям"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыПоЭквайрингу"

	Дано Я открываю основную форму отчета "РасчетыПоЭквайрингу"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыПоЭквайрингу"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСКомиссионерами"

	Дано Я открываю основную форму отчета "РасчетыСКомиссионерами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСКомиссионерами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСКомитентами"

	Дано Я открываю основную форму отчета "РасчетыСКомитентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСКомитентами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПерсоналом"

	Дано Я открываю основную форму отчета "РасчетыСПерсоналом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПерсоналом"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПодотчетниками"

	Дано Я открываю основную форму отчета "РасчетыСПодотчетниками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПодотчетниками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПокупателями"

	Дано Я открываю основную форму отчета "РасчетыСПокупателями"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПокупателями"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РасчетыСПоставщиками"

	Дано Я открываю основную форму отчета "РасчетыСПоставщиками"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РасчетыСПоставщиками"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД2"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеЕНВД4"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеЕНВД4"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеЕНВД4"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеИзменениеПараметраУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеИзменениеПараметраУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеИзменениеПараметраУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеОтказОтУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеОтказОтУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеОтказОтУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПереходНаУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПереходНаУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПереходНаУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПолучениеПатента"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПолучениеПатента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПолучениеПатента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеПатент"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеПрекращениеУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеПрекращениеУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеПрекращениеУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеСообщениеОбУчастии"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеСообщениеОбУчастии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеСообщениеОбУчастии"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеТС1"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеТС1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеТС1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеТС2"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеТС2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеТС2"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУ_ИО"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУ_ИО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУ_ИО"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУменьшениеНалогаККТ"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУменьшениеНалогаККТ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУменьшениеНалогаККТ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУтратаПраваПатент"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУтратаПраваПатент"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУтратаПраваПатент"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУтратаПраваУСН"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУтратаПраваУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУтратаПраваУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеУчастиеВРоссийскихОрганизациях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированноеУведомлениеФормаР24001"

	Дано Я открываю основную форму отчета "РегламентированноеУведомлениеФормаР24001"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированноеУведомлениеФормаР24001"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет4ФСС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет4ФСС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет4ФСС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчет6НДФЛ"

	Дано Я открываю основную форму отчета "РегламентированныйОтчет6НДФЛ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчет6НДФЛ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоЗаявлениеОКорректировке"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоЗаявлениеОКорректировке"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоЗаявлениеОКорректировке"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетАлкоПриложение12"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетАлкоПриложение12"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетАлкоПриложение12"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетБухОтчетностьМП"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетБухОтчетностьМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетБухОтчетностьМП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетНДС"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетНДС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетНДС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетПодтверждениеВидаДеятельности"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетПодтверждениеВидаДеятельности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетПодтверждениеВидаДеятельности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРасчетПоСтраховымВзносам"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРасчетПоСтраховымВзносам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРасчетПоСтраховымВзносам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетРСВ1"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетРСВ1"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетРСВ1"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаПрочиеФормы"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаПрочиеФормы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаПрочиеФормы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1ИПсвед"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1ИПсвед"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1ИПсвед"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетСтатистикаФорма1Предприниматель"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетСтатистикаФорма1Предприниматель"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетСтатистикаФорма1Предприниматель"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РегламентированныйОтчетУСН"

	Дано Я открываю основную форму отчета "РегламентированныйОтчетУСН"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РегламентированныйОтчетУСН"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрОплатЗаказовИСчетов"

	Дано Я открываю основную форму отчета "РеестрОплатЗаказовИСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрОплатЗаказовИСчетов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрСтаренияДебиторскойЗадолженности"

	Дано Я открываю основную форму отчета "РеестрСтаренияДебиторскойЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрСтаренияДебиторскойЗадолженности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РеестрСтаренияКредиторскойЗадолженности"

	Дано Я открываю основную форму отчета "РеестрСтаренияКредиторскойЗадолженности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РеестрСтаренияКредиторскойЗадолженности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "РозничныеПродажи"

	Дано Я открываю основную форму отчета "РозничныеПродажи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РозничныеПродажи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СводныйАнализЗаказовПокупателей"

	Дано Я открываю основную форму отчета "СводныйАнализЗаказовПокупателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СводныйАнализЗаказовПокупателей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СводныйАнализЗаказовПоставщикам"

	Дано Я открываю основную форму отчета "СводныйАнализЗаказовПоставщикам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СводныйАнализЗаказовПоставщикам"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СводныйОтчетЕГАИС"

	Дано Я открываю основную форму отчета "СводныйОтчетЕГАИС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СводныйОтчетЕГАИС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СдельныеНаряды"

	Дано Я открываю основную форму отчета "СдельныеНаряды"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СдельныеНаряды"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Себестоимость"

	Дано Я открываю основную форму отчета "Себестоимость"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Себестоимость"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Склад"

	Дано Я открываю основную форму отчета "Склад"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Склад"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СкладПоЗапасамВРемонте"

	Дано Я открываю основную форму отчета "СкладПоЗапасамВРемонте"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СкладПоЗапасамВРемонте"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СкладПоСерийнымНомерам"

	Дано Я открываю основную форму отчета "СкладПоСерийнымНомерам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СкладПоСерийнымНомерам"
	И Я закрываю текущее окно




Сценарий: Открытие формы объекта "СобытияМониторингаСПАРКРиски"

	Дано Я открываю основную форму отчета "СобытияМониторингаСПАРКРиски"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СобытияМониторингаСПАРКРиски"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СоставСегмента"

	Дано Я открываю основную форму отчета "СоставСегмента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СоставСегмента"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СпискиСотрудников"

	Дано Я открываю основную форму отчета "СпискиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СпискиСотрудников"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "СуммовойУчетВРознице"

	Дано Я открываю основную форму отчета "СуммовойУчетВРознице"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СуммовойУчетВРознице"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ТоварныйОтчетТОРГ29"

	Дано Я открываю основную форму отчета "ТоварныйОтчетТОРГ29"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ТоварныйОтчетТОРГ29"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Траты"

	Дано Я открываю основную форму отчета "Траты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Траты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УдалитьПлатежныйКалендарь"

	Дано Я открываю основную форму отчета "УдалитьПлатежныйКалендарь"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УдалитьПлатежныйКалендарь"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "УплатыНалоговИВзносов"

	Дано Я открываю основную форму отчета "УплатыНалоговИВзносов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УплатыНалоговИВзносов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФинансовыйРезультат"

	Дано Я открываю основную форму отчета "ФинансовыйРезультат"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФинансовыйРезультат"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ФинансовыйРезультатПрогноз"

	Дано Я открываю основную форму отчета "ФинансовыйРезультатПрогноз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ФинансовыйРезультатПрогноз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Ценообразование_СравнениеЦенЗаПериод"

	Дано Я открываю основную форму отчета "Ценообразование_СравнениеЦенЗаПериод"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Ценообразование_СравнениеЦенЗаПериод"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Ценообразование_ЦенаИзПоследнегоПоступления"

	Дано Я открываю основную форму отчета "Ценообразование_ЦенаИзПоследнегоПоступления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Ценообразование_ЦенаИзПоследнегоПоступления"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "Ценообразование_ЦенаИзПоследнейРеализации"

	Дано Я открываю основную форму отчета "Ценообразование_ЦенаИзПоследнейРеализации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Ценообразование_ЦенаИзПоследнейРеализации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ЧистыеАктивы"

	Дано Я открываю основную форму отчета "ЧистыеАктивы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЧистыеАктивы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объекта "ШтатноеРасписание"

	Дано Я открываю основную форму отчета "ШтатноеРасписание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ШтатноеРасписание"
	И Я закрываю текущее окно



